{
  "data": {
    "ABS": {
      "0160": "Data communication via vehicle CAN bus is faulty",
      "0162": "CAN bus speed signal from tachograph is faulty",
      "0163": "IES-CAN bus: communication interruption",
      "0167": "CAN signal from GS(EPS) system is missing or invalid",
      "0168": "CAN signal from FR control unit for driving is missing or faulty",
      "0169": "CAN signal from INS control unit for instrument is missing or faulty",
      "1001": "Increased voltage at terminal 15 (X1.18/7)",
      "1002": "Insufficient voltage or faulty contact at terminal 15",
      "1010": "ABS control unit for anti-lock braking system is faulty",
      "1012": "ABS anti-lock braking system control unit incorrectly parameterized",
      "1029": "Solenoid valve activation control triggered",
      "1094": "Different tire sizes on vehicle",
      "1102": "Insufficient voltage or faulty contact at terminal 30, X1 18/9",
      "1103": "Terminal 30, X1 18/9 is open",
      "1202": "Insufficient voltage or faulty contact at terminal 30, X1 18/8",
      "1203": "Terminal 30, X1 18/8 is open",
      "1602": "Insufficient voltage or faulty contact at terminal 31, X1 18/12",
      "1609": "Terminal 31, X1 18/12 is open",
      "1702": "Insufficient voltage or faulty contact at terminal 31, X1 18/11",
      "1709": "Terminal 31, X1 18/11 has an open circuit",
      "2004": "Interaxle lock: output signal has a short circuit to ground",
      "2005": "Interaxle lock: output signal has a short circuit to positive",
      "2103": "Trailer disconnection: output signal has an open circuit",
      "2104": "Trailer disconnection: output signal has a short circuit to ground",
      "2105": "Trailer disconnection: output signal has a short circuit to positive",
      "2112": "The \"Trailer disconnection\" output signal is incorrectly parameterized",
      "3020": "The ABS magnetic valve on the right front axle has an open circuit at contact X3 9/8",
      "3021": "The ABS magnetic valve on the right front axle has a short circuit to ground at contact X3 9/8",
      "3022": "The ABS solenoid valve on the right front axle has a short circuit to positive at contact X3 9/8",
      "3023": "The ABS solenoid valve on the right front axle has an open circuit at contact X3 9/9",
      "3026": "The ABS solenoid valve on the right front axle has an open circuit at contact X3 9/7",
      "3027": "The ABS solenoid valve on the right front axle has a short circuit to ground at contact X3 9/7",
      "3028": "The ABS solenoid valve on the right front axle has a short circuit to positive at contact X3 9/7",
      "3030": "The ABS solenoid valve on the right front axle has external excitation",
      "3120": "The ABS solenoid valve on the left front axle has an open circuit at contact X2 6/2",
      "3121": "ABS solenoid valve on the left front axle has a short circuit to ground at contact X2 6/2",
      "3122": "ABS solenoid valve on the left front axle has a short circuit to positive at contact X2 6/2",
      "3123": "ABS solenoid valve on the left front axle has an open circuit at contact X2 6/3",
      "3126": "ABS solenoid valve on the left front axle has an open circuit at contact X2 6/1",
      "3127": "ABS solenoid valve on the left front axle has a short circuit to ground at contact X2 6/1",
      "3128": "ABS solenoid valve on the left front axle has a short circuit to positive at contact X2 6/1",
      "3130": "ABS solenoid valve on the left front axle has external excitation",
      "3220": "ABS solenoid valve on the right rear axle has an open circuit at contact X4 15/11",
      "3221": "The ABS solenoid valve on the right rear axle has a short circuit to ground at contact X4 15/11",
      "3222": "The ABS solenoid valve on the right rear axle has a short circuit to positive at contact X4 15/11",
      "3223": "The ABS solenoid valve on the right rear axle has an open circuit at contact X4 15/12",
      "3226": "The ABS solenoid valve on the right rear axle has an open circuit at contact X4 15/10",
      "3227": "The ABS solenoid valve on the right rear axle has a short circuit to ground at contact X4 15/10",
      "3228": "The ABS solenoid valve on the right rear axle has a short circuit to positive at contact X4 15/10",
      "3230": "The ABS solenoid valve on the right rear axle has external excitation",
      "3320": "The ABS solenoid valve on the left rear axle has an open circuit at contact X4 15/2",
      "3321": "The ABS solenoid valve on the left rear axle has a short circuit to ground at contact X4 15/2",
      "3322": "The ABS solenoid valve on the left rear axle has a short circuit to positive at contact X4 15/2",
      "3323": "The ABS solenoid valve on the left rear axle has an open circuit at contact X4 15/3",
      "3326": "The ABS solenoid valve on the left rear axle has an open circuit at contact X4 15/1",
      "3327": "The ABS solenoid valve on the left rear axle has a short circuit to ground at contact X4 15/1",
      "3328": "The ABS solenoid valve on the left rear axle has a short circuit to positive at contact X4 15/1",
      "3330": "The ABS solenoid valve on the left rear axle has external excitation",
      "3604": "The ABS solenoid valve on the right front axle and left rear axle has a short circuit to ground at contact 2",
      "3605": "The ABS solenoid valve on the right front axle and left rear axle has a short circuit to positive at contact 2",
      "3704": "The ABS solenoid valve on the left front axle and right rear axle has a short circuit to ground at contact 2",
      "3705": "The ABS solenoid valve on the left front axle and right rear axle has a short circuit to positive at contact 2",
      "3804": "ASR solenoid valve has a short circuit to ground",
      "3805": "ASR solenoid valve has a short circuit to positive",
      "3809": "ASR solenoid valve has an open circuit",
      "3812": "ASR parameterization of the traction control system is incorrect",
      "3830": "ASR solenoid valve has external excitation",
      "4040": "Right front axle speed sensor has an open circuit",
      "4041": "Right front axle speed sensor has a short circuit to ground ",
      "4042": "Right front axle speed sensor has a short circuit to positive",
      "4044": "Right front axle speed sensor has a turn-to-turn short circuit",
      "4045": "Right front axle pole wheel is defective",
      "4046": "Right front axle speed sensor is emitting interference (cracking)",
      "4047": "The pole wheel on the right front axle is vibrating at the stop point",
      "4048": "The speed sensor on the right front axle has an air gap",
      "4140": "The speed sensor on the left front axle has an open circuit",
      "4141": "The speed sensor on the left front axle has a short circuit to ground",
      "4142": "The speed sensor on the left front axle has a short circuit to positive",
      "4144": "The speed sensor on the left front axle has an interturn short circuit",
      "4145": "The pole wheel on the left front axle is defective",
      "4146": "The speed sensor on the left front axle is producing interference (cracking)",
      "4147": "The pole wheel on the left front axle is loose at the stop point",
      "4148": "The speed sensor on the left front axle has an air gap",
      "4240": "The speed sensor on the right rear axle has an open circuit",
      "4241": "The speed sensor on the right rear axle has a short circuit to ground",
      "4242": "The speed sensor on the right rear axle has a short circuit to positive",
      "4244": "The speed sensor on the right rear axle has a turn-to-turn short circuit",
      "4245 ": "The pole wheel on the right rear axle is defective",
      "4246": "The speed sensor on the right rear axle is producing interference (cracking)",
      "4247": "The pole wheel on the right rear axle is loose in the stop point",
      "4248": "The speed sensor on the right rear axle has an air gap",
      "4340": "The speed sensor on the left rear axle has an open circuit",
      "4341": " The speed sensor on the left rear axle has a short circuit to ground",
      "4342": "The speed sensor ",
      "4344": "The speed sensor on the left rear axle has a short circuit to positive",
      "4345": "The pole wheel on the left rear axle is defective",
      "4346": "The speed sensor on the left rear axle is producing interference (cracking)",
      "4347": "The pole wheel on the left rear axle is loose in the stop point",
      "4348": " The speed sensor on the left rear axle has an air gap"
    },
    "AG": {
      "0097": "Low voltage at terminal 30",
      "0098": "Internal control unit fault",
      "0099": "High voltage at terminal 30",
      "1083": "Incorrect gearbox",
      "1084": "Internal control unit fault",
      "1085": "Internal control unit fault",
      "1086": "Internal control unit fault",
      "1087": "Internal control unit fault",
      "1088": "Internal control unit fault",
      "1089": "Internal control unit fault",
      "1090": "Internal control unit fault",
      "1091": "Internal control unit fault",
      "2220": "Fault in drive and slip control system",
      "2222": "Malfunction in the drive and traction control system",
      "2224": "Malfunction in the ABS or BS control unit",
      "2279": "CAN bus from the ABS or BS control unit has an error or malfunction",
      "2320": "Malfunction in the FR motion control system",
      "2322": "Malfunction in the FR motion control system",
      "2324": "Malfunction in the FR motion control system",
      "2326": "Malfunction in the FR motion control system",
      "2336": "Malfunction in the FR motion control system",
      "2349": "Malfunction in the FR motion control system",
      "2369": "Malfunction in the FR motion control system",
      "2379": "CAN bus from the FR control unit has an error or malfunction",
      "2409": "Malfunction in the FR motion control system",
      "2428": "Fault in FR ride control system",
      "2449": "Fault in FR ride control system",
      "2478": "Fault in FR ride control system",
      "2479": "CAN bus from FR control unit has an error or fault",
      "2500": "Fault in GS gear shift control system",
      "2502": "Fault in GS gear shift control system",
      "2504": "Fault in GS gear shift control system",
      "2506": "Fault in GS gear shift control system",
      "2529": "Fault in GS gear shift control system",
      "2569": "Fault in GS gear shift control system",
      "2579": "CAN bus from GS control unit has an error or fault",
      "2729": "Fault in ABS control unit or BS",
      "2749": "Malfunction in ABS or BS control unit",
      "2769": "Malfunction in ABS or BS control unit",
      "2779": "CAN bus from ABS or BS control unit has an error or malfunction",
      "2820": "Malfunction in GS gear shift control system",
      "2822": "Malfunction in GS gear shift control system",
      "2824": "Malfunction in GS gear shift control system",
      "2830": "Malfunction in GS gear shift control system",
      "2834": "Malfunction in GS gear shift control system",
      "2842": "Malfunction in GS gear shift control system",
      "2869": "Malfunction in GS gear shift control system",
      "2879": "CAN bus from GS control unit has an error or malfunction",
      "2910": "Fault in FR driving control system",
      "2928": "Fault in FR driving control system",
      "2958": "Fault in FR driving control system",
      "2968": "Fault in FR driving control system",
      "2979": "CAN bus from FR control unit has an error or fault",
      "3008": "Fault in FR driving control system",
      "3010": "Fault in FR driving control system",
      "3028": "Fault in FR driving control system",
      "3079": "CAN bus from FR control unit has an error or fault",
      "3120": "Fault in RS retarder control system",
      "3138": "Fault in RS retarder control system",
      "3179": "CAN bus from RS control unit has an error or fault",
      "3280": "Vehicle data from INS control unit changed / Error in communication with INS control unit",
      "3281": "No vehicle data stored in INS control unit / Error in communication with INS control unit",
      "3282": "CAN communication faulty / Error in communication with INS control unit",
      "3381": "Error in communication with GS control unit",
      "3382": "Error in communication with MR control unit"
    },
    "AGS": {
      "0160": "CAN bus is disabled (OFF)",
      "0161": "Communication failure with FR control unit (driving control)",
      "0167": "Communication failure with RS control unit (retarder control)",
      "0168": "Communication failure with ABS control unit",
      "0169": "Communication failure with INS control unit (instrument cluster)",
      "0171": "Communication failure with AG control unit (automatic shifting)",
      "0172": "Data transmission to vehicle CAN is faulty.",
      "0173": "Gearbox CAN bus in single-wire mode",
      "0174": "Gearbox CAN bus does not output data.",
      "0176": "CAN message ‘Nominal value of release bearing adjustment release’ has failed",
      "0177": "CAN message ‘Reliable condition of transmission elements’",
      "0361": "Failure of the replacement function of movement",
      "0901": "Increased voltage at terminal 30-2",
      "0902": "Decreased voltage at terminal 30-2",
      "0920": "Decreased voltage at terminal 30-2",
      "1001": "The power supply voltage of the travel sensors has an increased power supply.",
      "1002": "The power supply voltage of the travel sensors has a decreased power supply.",
      "1010": "Internal malfunction of the control unit",
      "1011": "A checksum error occurred while reading the EEPROM.",
      "1012": "A checksum error occurred while reading the EEPROM.",
      "1015": "A checksum error occurred while reading the EEPROM.",
      "1016": "A checksum error occurred while reading the EEPROM amounts.",
      "1097": "The software in the control unit is a test version.",
      "1098": "The control unit is a test version.",
      "1099": "The control unit mode for testing on a test bench is active.",
      "1101": "Increased voltage at terminal 30-1",
      "1102": "Lower voltage at terminal 30-1",
      "1120": "Lower voltage at terminal 30-1",
      "1220": "The ground wire of the solenoid valves has an open circuit.",
      "1301": "Increased voltage at terminal 15",
      "1302": "Lower voltage at terminal 15",
      "1420": "The power supply voltage of the speed sensor has an open circuit.",
      "1421": "The power supply voltage of the speed sensor has a short circuit to ground.",
      "1422": "The power supply voltage of the speed sensor has a short circuit to positive.",
      "1520": "The pressure sensor has an open circuit.",
      "1521": "The pressure sensor assembly has a short circuit to ground.",
      "1522": "The pressure sensor assembly has a short circuit to positive.",
      "1720": "The hydraulic pump output stage temperature sensor has a short circuit to positive or an open circuit.",
      "1721": "The hydraulic pump output stage temperature sensor has a short circuit to ground.",
      "1723": "The hydraulic pump output stage is overheated.",
      "1820": "The voltage of valve relay 1 cannot be activated.",
      "1821": "The voltage of valve relay 1 cannot be deactivated.",
      "1920": "The voltage of valve relay 2 cannot be activated.",
      "1921": "Voltage of valve relay 2 cannot be deactivated.",
      "2020": "The high voltage power supply ground wire has an open circuit.",
      "3020": "The A92u1 solenoid valve has a short circuit to positive or an open circuit.",
      "3021": "The A92u1 solenoid valve has a short circuit to ground.",
      "3120": "The A92u2 solenoid valve has a short circuit to positive or an open circuit.",
      "3121": "The A92u2 solenoid valve has a short circuit to ground.",
      "3220": "The A92u3 solenoid valve has a short circuit to positive or an open circuit.",
      "3221": "The A92u3 solenoid valve has a short circuit to ground.",
      "3320": "The A92u4 solenoid valve has a short circuit to positive or an open circuit.",
      "3321": "The A92u4 solenoid valve has a short circuit to ground.",
      "3420": "The A92u5 solenoid valve has a short circuit to positive or an open circuit.",
      "3421": "The A92u5 solenoid valve has a short circuit to ground.",
      "3520": "The A92u6 solenoid valve has a short circuit to positive or an open circuit.",
      "3521": "The A92u6 solenoid valve has a short circuit to ground.",
      "3620": "The A92u7 solenoid valve has a short circuit to positive or an open circuit.",
      "3621": "The A92u7 solenoid valve has a short circuit to ground.",
      "3720": "The A92u8 solenoid valve has a short circuit to positive or an open circuit.",
      "3721": "The A92u8 solenoid valve has a short circuit to ground.",
      "3820": "The A92u9 solenoid valve has a short circuit to positive or an open circuit.",
      "3821": "The A92u9 solenoid valve has a short circuit to ground.",
      "4120": "The 'Gear' sensor (SGG) has an open circuit.",
      "4121": "The 'Gear' sensor (SGG) has a short circuit to ground.",
      "4122": "The 'Gear' sensor (SGG) has a short circuit to positive.",
      "4143": "The 'Gear' sensor (SGG) component is malfunctioning",
      "4144": "The 'Gear1 sensor (SGG) component is outside the range of permissible values",
      "4220": "The 'Gear line' sensor (SGE) has an open circuit.",
      "4221": "The ’gear line’ (SGE) has a short circuit to ground.",
      "4222": "The ’gear line’ sensor (SGE) has a short circuit to positive.",
      "4243": "The ’gear line’ sensor (SGE) component is malfunctioning",
      "4244": "The ’gear line’ sensor (SGE) component is outside the permissible value range",
      "4420": "The ’clutch’ sensor (SKU) has an open circuit.",
      "4421": "The ’clutch’ sensor (SKU) has a short circuit to ground.",
      "4422": "The ’clutch’ sensor (SKU) has a short circuit to positive.",
      "4443": "The ’clutch’ sensor (SKU) component is malfunctioning",
      "4444": "The ’clutch’ sensor (SKU) component out of range",
      "5020": "No signal from speed sensor B113.",
      "5096": "Signal from speed sensor B113 is broken",
      "5120": "Signal from speed sensor B3 is missing.",
      "5121": "Speed sensor B3 ’intermediate shaft’ has a short to ground.",
      "5122": "Speed sensor B3 ’intermediate shaft’ has a short to positive or an open circuit.",
      "5196": "Signal from speed sensor B3 is broken",
      "5220": "Speed signal is missing.",
      "5296": "Speed signal is broken.",
      "5320": "Signal from speed sender B113.1 is missing.",
      "5396": "Speed sensor signal is broken B113.1",
      "6020": "The output or lead wire of the hydraulic pump output stage has an open circuit.",
      "6021": "The output or lead wire of the hydraulic pump output stage has a short to ground.",
      "8090": "Transfer case actual gear ratio plausibility error",
      "8091": "No output gearbox speed",
      "8093": "Incorrect gearbox type",
      "8094": "The specified direction of travel is not plausible.",
      "8095": "Too slow build-up of unit pressure when starting the system",
      "8110": "Plaisance error of the nominal value 'Clutch release bearing adjustment'",
      "8117": "Plaisance error of the nominal value 'Clutch adaptation value Minimum'",
      "8185": "Clutch position adjustment malfunction",
      "8186": "Error plausibility error due to clutch disengagement",
      "8187": "Plausibility error due to clutch engagement",
      "8189": "Plausibility error for nominal value 'Clutch stroke value'"
    },
    "BS": {
      "0117": "The speed signal from the tachograph does not match the speed signal from the FDR control unit.",
      "0160": "Data transmission to the vehicle CAN is disrupted.",
      "0162": "The CAN message ‘Speed signal (V)’ from the tachograph is invalid. OR Incorrect CAN message ’Speed signal (V)’ from the tachograph.",
      "0180": "Missing data on the vehicle CAN bus ‘ASR function’",
      "0181": "Missing data on the vehicle CAN bus ‘SMR function’",
      "0182": "Missing data on the vehicle CAN bus ‘Long-term brake assignment’",
      "0183": "Missing data on the vehicle CAN bus ‘Parking brake’",
      "0184": "Missing data on the vehicle CAN bus ‘Roll-away lock’",
      "0185": "Missing data on vehicle CAN bus ‘Stability control’",
      "0260": "Data exchange with the trailer CAN bus is interrupted. OR Incorrect signal on the trailer CAN.",
      "0263": "Data exchange with the trailer CAN bus is interrupted. OR The trailer CAN signal has an open circuit.",
      "0275": "Trailer CAN High fault.",
      "0276": "Trailer CAN Low fault.",
      "0300": "Complete failure of the brake CAN bus",
      "0463": "Data exchange on the brake CAN bus (path A) is interrupted.",
      "0563": "Data exchange on the brake CAN bus (path B) is interrupted.",
      "0910": "Hardware fault during programming of the control unit",
      "0911": "Control unit EEPROM faulty",
      "0930": "The control unit does not contain functional software!",
      "0931": "The control unit software used to program the control unit is incorrect.",
      "0932": "The control unit software is corrupted.",
      "0933": "The control unit software is corrupted.",
      "0934": "Incorrect identification block",
      "0935": "Incorrect control unit programming process",
      "0936": "checksum in the control unit software",
      "1001": "Increased voltage at terminal 15, 30a, 30Ь",
      "1002": "Low voltage or contact at terminals 15, 30a and 30Ь",
      "1010": "The BS control unit of the brake system control is defective. OR Internal fault in the BS control unit of the brake system",
      "1011": "The BS control unit of the brake system is faulty. OR Control unit EEPROM fault",
      "1012": "BS control unit brake system control parameterized incorrectly.",
      "1014": "BS control unit: invalid data from FDR/LWS/AM modules",
      "1033": "Activation of ABS solenoids invalid.",
      "1052": "Initialization: incomplete data.",
      "1094": "Wrong tires on vehicle OR Different tires on vehicle",
      "1102": "Low voltage or contact at terminal 30a",
      "1103": "Terminal 30a has an open circuit.",
      "1201": "Increased voltage at terminal 30",
      "1202": "Low voltage or contact at terminal 30 OR Low voltage or contact at terminal 30Ь",
      "1203": "Terminal 30 is open. OR Terminal 30Ь has an open circuit.",
      "1302": "Low voltage or contact at terminal 15",
      "1303": "Terminal 15 has an open circuit.",
      "1305": "Terminal 15 has a short circuit to positive.",
      "1404": "The ‘CBU Central Brake Unit’ component is faulty (the ’24 V’ power supply has a short circuit to ground).",
      "1405": "The ‘CBU Central Brake Unit’ component is faulty (the ’24 V’ power supply has a short circuit to positive).",
      "1505": "The power supply to the brake force modulator has a short circuit to positive.",
      "1605": "The BS control unit of the brake system control has a short circuit to positive at the output of the X3 16/8.",
      "1704": "The brake force modulator has a short circuit to short circuit to ground at output X68/6.",
      "1705": "The brake force modulator has a short circuit to positive at output X68/6.",
      "2003": "ASR solenoid valve has an open circuit.",
      "2004": "ASR solenoid valve has a short circuit to ground.",
      "2005": "ASR solenoid valve has a short circuit to positive.",
      "2012": "ASR deactivation is parameterized incorrectly.",
      "2203": "Component unit 'Rear Axle Overpressure Valve' has an open circuit.",
      "2204": "Component unit 'Rear Axle Overpressure Valve' has a short circuit to ground.",
      "2205": "Component unit 'Rear Axle Overpressure Valve' has a short circuit to positive.",
      "2291": "Duplicate pressure not retained by redundant valve 'Rear Axle'",
      "2404": "Component unit 'CBU Central Brake Unit' is defective (Front Axle Overpressure Valve has a short circuit to ground).",
      "2405": "The ‘CBU Central Brake Unit’ component is faulty (the front axle overpressure valve has a short circuit to positive).",
      "2407": "The ‘CBU Central Brake Unit’ component is faulty (the front axle overpressure valve has a short circuit to ground).",
      "2408": "The ‘CBU Central Brake Unit’ component is faulty (the front axle overpressure valve has a short circuit to positive).",
      "2409": "The ‘CBU Central Brake Unit’ component is faulty (the front axle overpressure valve has an open circuit).",
      "2429": "The ‘CBU Central Brake Unit’ component is faulty (the front axle overpressure valve has an external excitation).",
      "2504": "The center differential lock has a short circuit to ground at contact X2 18/18.",
      "2505": "The center differential lock has a short circuit to positive at contact X2 18/18.",
      "2603": "The auxiliary brake valve assembly has an open circuit.",
      "2604": "The auxiliary brake valve assembly has a short circuit to ground.",
      "2605": "The auxiliary brake valve assembly has a short circuit to positive.",
      "2612": "the auxiliary brake in the BS brake control unit is parameterized incorrectly.",
      "3012": "The front axle solenoid valve, right, is parameterized incorrectly.",
      "3020": "The front axle ABS solenoid valve, right, has an open circuit at contact 3.",
      "3021": "the front axle ABS valve, right, has a short circuit to ground at contact 3.",
      "3022": "The solenoid The right front axle ABS solenoid valve has a short circuit to positive at pin 3.",
      "3023": "The right front axle ABS solenoid valve has an open circuit at pin 2.",
      "3026": "The right front axle ABS solenoid valve has an open circuit at pin 1.",
      "3027": "The right front axle ABS solenoid valve has a short circuit to ground at pin 1.",
      "3028": "The right front axle ABS solenoid valve has a short circuit to positive at pin 1.",
      "3029": "The right front axle ABS solenoid valve has an external control signal.",
      "3120": "The left front axle ABS solenoid valve has an open circuit at pin 3.",
      "3121": "The left front axle ABS solenoid valve has a short circuit to ground at pin 3.",
      "3122": "The left front axle ABS solenoid valve has a short circuit to short circuit to positive at pin 3.",
      "3123": "The left front axle ABS solenoid valve has an open circuit at pin.",
      "3126": "The left front axle ABS solenoid valve has an open circuit at pin.",
      "3127": "The left front axle ABS solenoid valve has a short circuit to ground at pin 1.",
      "3128": "The left front axle ABS solenoid valve has a short circuit to positive at pin 1.",
      "3129": "The left front axle ABS solenoid valve has an external control signal.",
      "3220": "The right rear axle ABS solenoid valve has an open circuit at pin 3.",
      "3221": "The right rear axle ABS solenoid valve has a short circuit to ground at pin 3.",
      "3222": "The right rear axle ABS solenoid valve has a short circuit to positive at pin 3.",
      "3223": "The rear right ABS solenoid valve has an open circuit at pin 2.",
      "3226": "The rear right ABS solenoid valve has an open circuit at pin 1.",
      "3227": "The rear right ABS solenoid valve has a short circuit to ground at pin 1.",
      "3228": "The rear right ABS solenoid valve has a short circuit to positive at pin 1.",
      "3229": "The rear right ABS solenoid valve has an external control signal.",
      "3320": "The rear left ABS solenoid valve has an open circuit at pin 3.",
      "3321": "The rear left ABS solenoid valve has a short circuit to ground at pin 3.",
      "3322": "The rear left ABS solenoid valve has a short circuit to positive at pin 3.",
      "3323": "The left rear axle ABS solenoid valve has an open circuit at pin 2.",
      "3326": "The left rear axle ABS solenoid valve has an open circuit at pin 1.",
      "3327": "The left rear axle ABS solenoid valve has a short circuit to ground at pin 1.",
      "3328": "The left rear axle ABS solenoid valve has a short circuit to positive at pin 1.",
      "3329": "The left rear axle ABS solenoid valve has an external control signal.",
      "3604": "The ABS solenoid valve has a short circuit to ground at pin 2. OR The left and right front axle ABS solenoid valves have a short circuit to ground at pin 2.",
      "3605": "The ABS solenoid valves have a short circuit to positive at pin 2. OR The left and right front axle ABS solenoid valves have a short circuit to positive at pin 2.",
      "4040": "The speed sensor on the right front axle has an open circuit.",
      "4041": "The speed sensor on the right front axle has a short circuit to ground.",
      "4042": "The speed sensor on the right front axle has a short circuit to positive.",
      "4044": "Short circuit in the turns of the speed sensor on the right front axle.",
      "4045": "The inductor on the right front axle is faulty.",
      "4046": "Gap of the speed sensor on the right front axle",
      "4047": "Beating of the inductor due to distortion on the right front axle.",
      "4048": "Gap of the speed sensor on the right front axle.",
      "4049": "Invalid wheel speed on the speed sensor ‘Front axle right’",
      "4140": "The speed sensor on the front axle on the left has an open circuit.",
      "4141": "The speed sensor on the front axle on the left has a short circuit to ground.",
      "4142": "The speed sensor on the front axle on the left has a short circuit to positive.",
      "4144": "Short circuit of the speed sensor turns on the front axle on the left.",
      "4145": "The inductor on the front axle on the left is faulty.",
      "4146": "Vibration of the speed sensor on the front axle on the left",
      "4147": "Beating of the inductor due to distortion on the front axle on the left.",
      "4148": "Gap of the speed sensor on the front axle on the left.",
      "4149": "Invalid wheel speed on the speed sensor ‘Front axle left’",
      "4240": "The speed sensor on the rear axle on the right has an open circuit.",
      "4241": "The speed sensor on the right rear axle has a short circuit to ground.",
      "4242": "The speed sensor on the right rear axle has a short circuit to positive.",
      "4244": "Short circuit in the speed sensor on the right rear axle.",
      "4245": "The inductor on the right rear axle is faulty.",
      "4246": "Right rear axle speed sensor vibration",
      "4247": "Right rear axle inductor beating due to skewing.",
      "4248": "Right rear axle speed sensor gap.",
      "4249": "Invalid wheel speed on right rear axle speed sensor",
      "4340": "Left rear axle speed sensor circuit open.",
      "4341": "Left rear axle speed sensor has short circuit to ground.",
      "4342": "Left rear axle speed sensor has short circuit to positive.",
      "4344": "Left rear axle speed sensor turns short circuit. OR Left rear axle sensor turns short circuit",
      "4345": "Left rear axle inductor is faulty.",
      "4346": "Vibration of the speed sensor on the left rear axle",
      "4347": "Beating due to skewing of the rear left inductor",
      "4348": "Gap of the speed sensor on the left rear axle. OR Rear left speed sensor, gap",
      "4349": "Invalid wheel speed on the speed sensor on the left rear axle",
      "5041": "The brake pad wear sensor on the right front axle has a short circuit to ground.",
      "5042": "The brake pad wear sensor on the right front axle has a short circuit to positive. OR The signal from the front right brake pad wear sensor has a short circuit to positive.",
      "5043": "The signal from the front right brake pad wear sensor cannot be measured.",
      "5049": "The front right brake pad wear sensor has an invalid signal.",
      "5141": "The front left brake pad wear sensor has a short circuit to ground.",
      "5142": "The front left brake pad wear sensor has a short circuit to positive. OR The signal from the left front axle brake pad wear sensor has a short circuit to positive.",
      "5143": "The signal from the left front axle brake pad wear sensor cannot be measured.",
      "5149": "The left front axle brake pad wear sensor has an invalid signal.",
      "5204": "The power supply for the brake pad wear sensors and the front axle pressure sensor has a short circuit to ground. OR The wiring for the front axle brake pad wear sensor has a short circuit to ground.",
      "5205": "The power supply for the brake pad wear sensors and the front axle pressure sensor has a short circuit to positive. OR The front axle brake pad wear sensor wiring has a short circuit to positive.",
      "5341": "The right rear axle brake pad wear sensor has a short circuit to ground.",
      "5342": "The right rear axle brake pad wear sensor has a short circuit to positive. / The signal from the right rear axle brake pad wear sensor has a short circuit to positive.",
      "5343": "The signal from the right rear axle brake pad wear sensor cannot be measured.",
      "5349": "The right rear axle brake pad wear sensor has an invalid signal.",
      "5441": "The left rear axle brake pad wear sensor has a short circuit to ground.",
      "5442": "The left rear axle brake pad wear sensor has a short circuit to positive. OR The signal from the brake pad wear sensor on the left rear axle has a short circuit to positive.",
      "5443": "The signal from the brake pad wear sensor on the left rear axle cannot be measured.",
      "5449": "The brake pad wear sensor on the left rear axle has an invalid signal.",
      "5504": "The power supply for the rear axle pressure sensor and the trailer control valve has a short circuit to ground. OR The wiring for the brake pad wear sensor on the rear axle has a short circuit to ground.",
      "5505": "The power supply for the rear axle pressure sensor and the trailer control valve has a short circuit to positive. OR The wiring of the brake pad wear sensor on the rear axle has a short to positive.",
      "6000": "The CBU Central Brake Unit is faulty (brake torque sensor is faulty)",
      "6092": "Brake valve sensor: incorrect signal synchronization OR The CBU Central Brake Unit is faulty (brake torque sensor: synchronization signal is incorrect)",
      "6098": "The CBU Central Brake Unit is faulty (accelerator and brake pedal signals are invalid).",
      "6140": "The CBU Central Brake Unit is faulty (stop light switch K1: signal has an open circuit).",
      "6141": "The CBU Central Brake Unit is faulty (stop light switch K1: signal has a short circuit to ground).",
      "6142": "The CBU Central Brake Unit is faulty (stop light switch K1: signal has a short circuit to positive).",
      "6192": "No signal from brake switch K1.",
      "6240": "The CBU Central Brake Unit is faulty (stop light switch K2: signal has an open circuit).",
      "6241": "The CBU Central Brake Unit faulty (K2 brake light switch: signal has short circuit to ground).",
      "6242": "CBU Central Brake Unit faulty (K2 brake light switch: signal has short circuit to positive).",
      "6292": "No signal from brake switch K2.",
      "6304": "K1 brake value has short circuit to ground at pin 1.",
      "6305": "K1 brake value has short circuit to positive at pin 1.",
      "6341": "CBU Central Brake Unit faulty (K1 brake value sensor: pedal position has short circuit to ground.)",
      "6342": "K1 brake value has short circuit to positive at pin 4.",
      "6343": "K1 brake valve sender signal cannot be measured. OR The CBU Central Brake Unit is faulty (Brake value sensor K1: pedal position does not transmit a signal).",
      "6404": "Brake value K2 has a short circuit to ground at pin 1.",
      "6405": "Brake value K2 has a short circuit to positive at pin 1.",
      "6441": "The CBU Central Brake Unit is faulty (Brake value sensor K2: pedal position has a short circuit to ground).",
      "6442": "Brake value K2 has a short circuit to positive at pin 4.",
      "6443": "The signal from the brake valve sensor K2 cannot be measured. OR The CBU Central Brake Unit component is faulty (brake value sensor K2: pedal position is not accompanied by a signal transmission).",
      "7000": "The CBU Central Brake Unit component is faulty (proportional relay valve is faulty)",
      "7096": "The CBU Central Brake Unit component is faulty (proportional relay valve has an invalid pressure value).'",
      "7104": "The CBU Central Brake Unit component is faulty (proportional relay valve is faulty)",
      "7105": "The CBU Central Brake Unit component is faulty (proportional relay valve is faulty)",
      "7107": "The CBU Central Brake Unit component is faulty (proportional relay valve is faulty)",
      "7108": "The CBU Central Brake Unit component is faulty (proportional relay valve is faulty) faulty)",
      "7109": "The CBU Central Brake Unit is faulty (proportional relay valve faulty)",
      "7120": "The front axle pressure control module has an open circuit at pin 1.",
      "7121": "The front axle pressure control module has a short circuit to ground at pin 1.",
      "7122": "The front axle pressure control module has a short circuit to positive at pin 1.",
      "7123": "The front axle pressure control module has an open circuit at pin 2.",
      "7126": "The front axle pressure control module has an open circuit at pin 7.",
      "7127": "The front axle pressure control module has a short circuit to ground at pin 7.",
      "7128": "The front axle pressure control module has a short circuit to positive at pin 7.",
      "7129": "Front axle pressure control unit has external control signal. OR Central Brake Unit CBU is faulty (proportional relay valve has external excitation).",
      "7130": "Front axle pressure control module has open circuit at pin 3.",
      "7131": "Front axle pressure control module short circuit to ground at pin 3.",
      "7132": "Front axle pressure control module short circuit to positive at pin 3.",
      "7190": "Front axle pressure control unit redundancy failed.",
      "7241": "Front axle pressure control module short circuit to ground at pin 6.",
      "7242": "Front axle pressure control module short circuit to positive at pin 6. OR Component ’CBU Central Brake Unit’ is faulty (proportional relay valve: pressure sensor has short circuit to positive).",
      "7243": "Component ’CBU Central Brake Unit1 is faulty (proportional relay valve: pressure sensor has open circuit, no signal or short circuit).",
      "7296": "Pressure sensor in front axle pressure control unit has invalid value.",
      "7300": "Drive axle brake force modulator defective",
      "7302": "Low voltage or poor contact at drive axle brake force modulator",
      "7313": "Brake force modulator: incorrect type installed",
      "7314": "Drive axle brake force modulator provides invalid data.",
      "7316": "Rear axle brake force modulator defective.",
      "7364": "Data exchange on the brake system CAN bus is faulty",
      "7365": "Data exchange between the brake force modulator and the steering angle sensor/FDR control unit is faulty",
      "7392": "Rear axle brake force modulator: synchronization signal incorrect",
      "7395": "Brake force modulator: auxiliary pressure control",
      "7500": "Trailer control valve defective",
      "7512": "Trailer control valve parameterized incorrectly.",
      "7596": "Trailer control valve has implausible pressure values.",
      "7604": "Trailer control valve has a short circuit to ground at terminal Y23/4.",
      "7605": "Trailer control valve has a short circuit to positive at terminal Y23/4.",
      "7607": "The trailer control valve has a short circuit to ground at terminal Y23/5.",
      "7608": "The trailer control valve has a short circuit to positive at terminal Y23/5.",
      "7609": "The trailer control valve has an open circuit at terminal Y23/4 or Y23/5.",
      "7620": "The trailer control valve has an open circuit at terminal 1.",
      "7621": "The trailer control valve has a short circuit to ground at terminal 7.",
      "7622": "The trailer control valve has a short circuit to positive at terminal 7.",
      "7623": "The trailer control valve has an open circuit at terminal 2.",
      "7626": "The trailer control valve has an open circuit at terminal 1.",
      "7627": "The trailer control valve has a short to ground at pin 1.",
      "7628": "The trailer control valve has a short to positive at pin 1.",
      "7629": "The trailer control valve has an external control signal. OR Trailer control valve has external excitation.",
      "7690": "Trailer control valve redundancy has failed.",
      "7741": "Trailer control valve has a short to ground at pin 6.",
      "7742": "Trailer control valve has a short to positive at pin 6. OR Trailer control valve: pressure sensor has a short to positive.",
      "7743": "Trailer control valve: pressure sensor has an open circuit, no signal, or short.",
      "7791": "Trailer control valve actual pressure values are too high.",
      "7796": "The pressure sensor in the trailer control valve has an invalid value.",
      "7904": "The valve ground at contact X2 18/9 has a short circuit to ground.",
      "7905": "The valve ground at contact X2 18/9 has a short circuit to positive.",
      "8090": "Rear axle brake circuit: redundancy has failed",
      "8193": "Thermal overload of the wheel brake mechanism",
      "8290": "Front axle brake circuit: no effect of redundancy",
      "8570": "Invalid deactivation of the parking brake",
      "8600": "CAN message from the ABA Active Brake Assist control unit is invalid or invalid.",
      "8620": "The rear axle pressure control module has an open circuit at contact 1.",
      "8621": "Rear axle pressure control module short circuit to ground at pin 1.",
      "8622": "Rear axle pressure control module short circuit to positive at pin 1.",
      "8623": "Rear axle pressure control module has an open circuit at pin 2.",
      "8626": "Rear axle pressure control module has an open circuit at pin 7.",
      "8627": "Rear axle pressure control module short circuit to ground at pin 7.",
      "8628": "Rear axle pressure control module short circuit to positive at pin 7.",
      "8629": "Rear axle pressure control unit has external control signal.",
      "8630": "Rear axle pressure control module has an open circuit at pin 3.",
      "8631": "Rear axle pressure control module short circuit to ground at pin 3.",
      "8632": "Rear axle pressure control module short circuit to positive at pin 3.",
      "8663": "Communication between the ABA Active Brake Assist control unit and the BS brake system control is broken.",
      "8690": "Redundancy on the rear axle pressure control unit has failed.",
      "8741": "Rear axle pressure control module short circuit to ground at pin 6.",
      "8742": "Rear axle pressure control module short circuit to positive at pin 6.",
      "8796": "The pressure sensor in the rear axle pressure control unit has an invalid value.",
      "9002": "The FDR control unit has low voltage at terminal 1.",
      "9010": "FDR module internal error",
      "9011": "FDR module EEPROM error",
      "9012": "Incorrect parameterization of the FDR module",
      "9013": "Incorrect FDR control unit installed.",
      "9051": "The FDR control unit has an incorrect installation position.",
      "9052": "The initialization (learning) process of the FDR control unit was not completed.",
      "9064": "Communication between the brake system CAN bus modules is interrupted.",
      "9065": "Communication between the brake system CAN bus modules is interrupted.",
      "9502": "Steering angle sensor has undervoltage.",
      "9510": "Steering angle sensor defective.",
      "9512": "Steering angle sensor in the BS brake control unit is incorrectly parameterized.",
      "9515": "Steering angle sensor provides invalid data.",
      "9543": "Steering angle sensor steering wheel angle sensor does not provide a measured value.",
      "9550": "The steering wheel angle sensor provides invalid data.",
      "9553": "The BS control unit detects a failure of the steering wheel angle sensor.",
      "9563": "The steering wheel angle sensor detects a CAN communication error.",
      "9565": "The BS control unit detects a failure of the steering wheel angle sensor.",
      "9597": "The steering wheel angle sensor provides an invalid steering ratio."
    },
    "FFB": {
      "1010": "Internal check indicates internal control unit fault.",
      "1011": "Internal check indicates internal control unit fault.",
      "2021": "Receiver wire faulty due to short circuit to ground.",
      "2022": "Receiver wire faulty due to short circuit to positive.",
      "2031": "Faulty coupling point on FFB remote control unit",
      "3050": "Transmitter module (remote control unit) reports low voltage."
    },
    "FR": {
      "0110": "CAN message from the ABS anti-lock braking system control unit is missing or incorrect.",
      "0111": "The value measured by the GS control unit is invalid.",
      "0112": "CAN message from the control unit is missing or invalid.",
      "0113": "CAN message from the retarder control unit RS is missing or invalid.",
      "0114": "CAN message from the instrument cluster control unit INS is missing or invalid.",
      "0115": "CAN message from the parameterizable special module control unit PSM is missing or invalid.",
      "0117": "The value measured by the torque converter clutch control unit WSK is invalid.",
      "0119": "The value measured by the KWS control unit is invalid.",
      "0180": "The value measured by the ART control unit invalid.",
      "0201": "Engine CAN to MR control unit in single-wire mode",
      "0202": "CAN message from MR control unit missing or invalid.",
      "0203": "Engine CAN to MR control unit: open circuit",
      "0306": "Engine CAN to FLA system: open circuit",
      "0416": "High-Speed-CAN bus failed more than 100 m/sec.",
      "0418": "High-Speed-CAN bus failed.",
      "0501": "Transmission CAN bus in single-wire mode",
      "0508": "Transmission CAN bus does not output data.",
      "0584": "KR function limited",
      "0681": "Automatic gear selection system failed",
      "0682": "Automatic gear selection system in emergency mode",
      "0783": "Error while requesting data",
      "1120": "Connector ‘D+’ has a short circuit to positive.",
      "1125": "Connector ‘D+’ on contact X4 18/13 is invalid or has an open circuit or a short circuit to ground.",
      "1223": "Clutch pedal switch 1 on contact X1 18/1 has an open circuit or is incorrectly adjusted.",
      "1421": "Brake light switch has an open circuit or is incorrectly adjusted.",
      "1423": "Brake light switch on contact X118/11 has a short circuit.",
      "1523": "Temporam switch defective.",
      "1524": "Temporam switch defective.",
      "1526": "Input ‘Quit’ tempomat switch open.",
      "1623": "Clutch pedal sensor 1 and 2: incorrect adjustment or sensor stuck",
      "1723": "The neutral position switch on contact X418/16 is faulty or stuck.",
      "1923": "The divider switch on contacts X2 18/11 and X2 18/12 has an open circuit or is faulty.",
      "2023": "The engine brake switch of the ‘Engine/Retarder Control’ actuation lever is faulty",
      "2120": "Output X1 18/13 has a short circuit to positive.",
      "2122": "Output X1 18/13 has a short circuit to ground.",
      "2520": "Switch block 1/4 has a short circuit to positive.",
      "2522": "Switch block 1/4 has a short circuit to ground.",
      "2620": "Switch block 2/3 has a short circuit to positive.",
      "2622": "Switch block 2/3 has a short circuit to ground.",
      "2720": "The oil level sensor in the M2 automatic engine oil filling system has a short circuit to positive.",
      "2823": "ART dual key control",
      "2923": "Shift lever module invalid",
      "2927": "GS sensor unit is jammed.",
      "2928": "GS sensor unit is faulty.",
      "2929": "The GS sensor unit 'Auto/Manual' key is jammed.",
      "3021": "Terminal 30 has an open circuit.",
      "3031": "Terminal 30: high voltage",
      "3032": "Terminal 30: low voltage",
      "3130": "Coolant level sensor XZ 15/11 or air filter control sensor XZ 15/1 is faulty, power supply XZ 15/13 has an open circuit or short circuit to positive or ground.",
      "3233": "Air filter control sensor is faulty.",
      "3236": "Air filter contamination limit has been reached.",
      "3330": "Outside air temperature sensor has an open circuit/short circuit to positive/ground",
      "3430": "Clutch travel sensor has an open circuit, short circuit to ground or short circuit to positive.",
      "3533": "Coolant level sensor is faulty.",
      "3634": "Max. clutch lining wear reached.",
      "3635": "Clutch travel sensor outside permissible range",
      "4141": "Signal ‘Input number KGT rpm is invalid.",
      "4145": "Gearbox input shaft speed sensor: open circuit/short circuit to positive/ground",
      "4341": "Invalid speed signal (V)",
      "4345": "The speed signal has an open circuit or a short circuit to ground or positive.",
      "4440": "The first branch of the accelerator pedal sensor has an open circuit or a short circuit to ground or positive.",
      "4540": "The second branch of the accelerator pedal sensor has an open circuit or a short circuit to ground or positive.",
      "4641": "Faulty accelerator pedal sensor",
      "4642": "The accelerator pedal sensor does not reach the idle stop.",
      "4643": "The accelerator pedal sensor value is outside the parameterized range",
      "4644": "Tight movement of the accelerator pedal sensor",
      "5052": "Solenoid valve 1 at contact XZ 15/4 has a short circuit to ground.",
      "5053": "Solenoid valve 1 at contact XZ 15/4 has a short circuit to positive.",
      "5054": "Solenoid valve 1 at contact XZ 15/4 has an open circuit.",
      "5152": "Solenoid valve 2 at contact XZ 15/7 has a short circuit to ground.",
      "5153": "Solenoid valve 2 at contact XZ 15/7 has a short circuit to positive.",
      "5154": "Solenoid valve 2 at contact XZ 15/7 has an open circuit.",
      "5252": "The common ground wire of the constant throttle and retarder electromagnetic valve has a short circuit to ground.",
      "5253": "The common ground wire of the constant throttle and retarder has a short circuit to positive.",
      "5352": "Solenoid valve ‘Split 1’ has a short circuit to ground.",
      "5353": "Solenoid valve ‘Split 1’ has a short circuit to positive.",
      "5354": "Solenoid valve ‘Split 1’ has an open circuit.",
      "5452": "Solenoid valve ‘Split 2’ has a short circuit to ground.",
      "5453": "Solenoid valve ‘Split 2’ has a short circuit to positive.",
      "5454": "Solenoid valve ‘Split 2’ has an open circuit.",
      "5552": "Common ground wire of solenoids Y29 and Y30 has a short circuit to ground.",
      "5553": "Common ground wire of solenoids Y29 and Y30 has a short circuit to positive.",
      "5652": "Output \"Brake Light Control\" has a short circuit to ground.",
      "5653": "The \",Brake Light Control\" output has a short circuit to positive.",
      "5654": "The \"Brake Light Activation\", output has an open circuit.",
      "5752": "The \"Reverse Light Control\", output has a short circuit to ground.",
      "5753": "The \"Reverse Light Control\", output has a short circuit to positive.",
      "5754": "The \"Reverse Light Control\", output has an open circuit.",
      "5852": "The \"D+ Activation\", output has a short circuit to ground.",
      "5853": "The \"D+ Activation\", output has a short circuit to positive.",
      "5854": "The \"D+ Activation\", output has an open circuit.",
      "5952": "Activation of automatic refilling of engine oil has a short circuit to ground.",
      "5953": "Activation of automatic refilling of engine oil has a short circuit to positive.",
      "5954": "Activation of automatic refilling of engine oil has an open circuit.",
      "6262": "Internal error in the control unit.",
      "6265": "Internal error in the control unit.",
      "6365": "Internal error in the control unit.",
      "7064": "Internal error in the control unit.",
      "7070": "Accelerator pedal unit not taught",
      "7071": "Initialization (learning) error of the gear ratio of the divider",
      "7072": "Initialization (learning) error of the gear ratio of the W terminal",
      "7073": "Learning error of the clutch travel sensor",
      "7074": "Initialization (training) error on the vehicle CAN bus",
      "8023": "HL5 switch position is invalid"
    },
    "FTCO": {
      "100": "Speed sensor fault",
      "101": "First driver tachogram disc tray fault",
      "102": "Second driver tachogram disc tray fault",
      "103": "Control shaft not positioned",
      "104": "Electronics fault",
      "001": "Rotation speed sensor fault",
      "002": "Displacement pulse output fault",
      "003": "Speed output fault"
    },
    "GS": {
      "0160": "Vehicle CAN bus has a fault",
      "0161": "CAN connection has an open circuit OR Communication fault on the vehicle CAN bus",
      "0162": "Communication fault with the FR (FMR) control unit",
      "0163": "Communication fault with the PSM control unit",
      "0164": "Communication fault with the WSK control unit",
      "0165": "Communication fault with the RS (RET) control unit",
      "0166": "Communication fault with the ABS or BS (EPB) control unit",
      "0167": "Communication fault with the INS control unit",
      "0168": "Communication fault with the KS (MKR) control unit",
      "0169": "Communication fault with the AG (AGE) control unit",
      "0170": "Communication fault with the MR (PLD) control unit",
      "0171": "Communication fault with WS control unit OR Communication fault with WS control unit (FSS)",
      "1010": "Internal error in control unit",
      "1011": "Invalid data for matching",
      "1012": "GS (EPS) control unit incorrectly parameterized",
      "1080": "TEST-Electronics OR TEST-Software",
      "1081": "TEST-Computer software",
      "1082": "Test bench module activated",
      "1101": "Overvoltage at terminal 30",
      "1102": "Insufficient voltage at terminal 30",
      "1201": "Ground cable for control unit has an open circuit",
      "1301": "Overvoltage at terminal 15",
      "1302": "Insufficient voltage at terminal 15",
      "1503": "Power supply for joystick is open",
      "1504": "Power supply for joystick is short to ground / Power supply for joystick and for rotation sensor B57/B99 is short to ground / Power supply for joystick and for rotation sensor B57 is short to ground",
      "1505": "Power supply for joystick is short to positive / Power supply for joystick and for rotation sensor B57/B99 is short to positive / Power supply for joystick and for rotation sensor B57 is short to positive",
      "2030": "Communication fault with joystick",
      "2031": "Ground cable for joystick is open",
      "2032": "Cable for emergency mode switch is open",
      "2033": "The cable for the emergency mode switch has a short circuit to ground / The ground cable for the joystick has a short circuit to ground",
      "2034": "The cable for the emergency mode switch has a short circuit to positive / The ground cable for the joystick has a short circuit to positive",
      "2035": "Error removing the prohibition on turning on the emergency electronics",
      "2036": "The emergency mode switch has failed",
      "2037": "The final stage of the feedback has a malfunction",
      "3020": "GS (EPS) valve block, solenoid valve MS1 has an open circuit",
      "3021": "GS (EPS) valve block, solenoid valve MS2 has an open circuit",
      "3022": "GS (EPS) valve block, solenoid valve MS1 has a short circuit to ground",
      "3023": "GS (EPS) valve block, solenoid valve MS2 has a short circuit to ground",
      "3024": "GS (EPS) valve block, solenoid valve MS1 has a short circuit to positive",
      "3025": "GS (EPS) valve block, solenoid valve MS2 has a short circuit to positive",
      "3120": "GS (EPS) valve block, solenoid valve MUB has an open circuit",
      "3121": "GS (EPS) valve block, solenoid valve MGB has an open circuit",
      "3122": "Valve block GS (EPS), solenoid valve MUB has a short circuit to ground",
      "3123": "GS (EPS) valve block, solenoid valve MGB has a short circuit to ground",
      "3124": "GS (EPS) valve block, solenoid valve MUB has a short circuit to positive",
      "3125": "GS (EPS) valve block, solenoid valve MGB has a short circuit to positive",
      "3220": "GS (EPS) valve block, solenoid valve MUE has an open circuit",
      "3221": "GS (EPS) valve block, solenoid valve MGE has an open circuit",
      "3222": "GS (EPS) valve block, solenoid valve MUE has a short circuit to ground",
      "3223": "GS (EPS) valve block, solenoid valve MGE has a short circuit to ground",
      "3224": "GS (EPS) valve block, solenoid valve MUE has a short circuit to positive",
      "3225": "GS (EPS) valve block, solenoid valve MGE has a short circuit to positive",
      "3320": "GS (EPS) valve block, solenoid valve MG1 has an open circuit",
      "3321": "GS (EPS) valve block, solenoid valve MG2 has an open circuit",
      "3322": "GS (EPS) valve block, solenoid valve MG1 has a short circuit to ground",
      "3323": "GS (EPS) valve block, solenoid valve MG2 has a short circuit to ground",
      "3324": "GS (EPS) valve block, solenoid valve MG1 has a short circuit to positive",
      "3325": "GS (EPS) valve block, solenoid valve MG2 has a short circuit to positive",
      "3420": "GS (EPS) valve block, solenoid valve MR1 has an open circuit",
      "3421": "GS (EPS) valve block, solenoid valve MR2 has an open circuit",
      "3422": "GS (EPS) valve block, solenoid valve MR1 has a short circuit to ground",
      "3423": "GS (EPS) valve block, solenoid valve MR2 has a short circuit to ground",
      "3424": "GS (EPS) valve block, solenoid valve MR1 has a short circuit to positive",
      "3425": "GS (EPS) valve block, solenoid valve MR2 has a short circuit to positive",
      "3803": "Common ground cable of solenoid valves has an open circuit",
      "3804": "Common ground cable of solenoid valves has a short circuit to ground",
      "3805": "Common ground cable of solenoid valves has a short circuit to positive",
      "4040": "Sensor divider has an open circuit",
      "4041": "The divider sensor has a short circuit to ground",
      "4042": "The divider sensor has a short circuit to positive",
      "4043": "Fault in the operation of the splitter sensor components",
      "4044": "Fault in the splitter sensor component outside the acceptable parameter limits",
      "4140": "Gear shift sensor has an open circuit",
      "4141": "Gear shift sensor has a short circuit to ground",
      "4142": "Gear shift sensor has a short circuit to positive",
      "4143": "Fault in the operation of the gear shift sensor components",
      "4144": "Gear shift sensor component outside the acceptable parameter limits",
      "4240": "Lag shift sensor has an open circuit",
      "4241": "Lag shift sensor has a short circuit to ground",
      "4242": "Lag shift sensor has a short circuit to positive",
      "4243": "Fault in the operation of the gear shift sensor components",
      "4244": "Lag shift sensor component outside the acceptable parameter limits",
      "4340": "Lag shift sensor ",
      "4341": "Range switch sensor has a short circuit to ground",
      "4342": "Range switch sensor has a short circuit to positive",
      "4343": "Range switch sensor component malfunction",
      "4344": "Range switch sensor component is out of acceptable parameter range",
      "4440": "Clutch travel sensor has an open circuit",
      "4441": "Clutch travel sensor has a short circuit to ground",
      "4442": "Clutch travel sensor has a short circuit to positive",
      "4443": "Clutch travel sensor component malfunction",
      "4444": "Clutch travel sensor component is out of acceptable parameter range",
      "5040": "No signal from B57 rotation sensor",
      "5043": "B57 component malfunction / Rotation sensor malfunction",
      "5140": "B3 speed sensor for intermediate has an open circuit / Signal from rotation sensor B3 is missing",
      "5141": "Speed sensor B3 for the intermediate shaft has a short circuit to ground",
      "5142": "Speed sensor B3 for the intermediate shaft has a short circuit to positive / Speed sensor B3 for the intermediate shaft has an open circuit or short circuit to positive",
      "5143": "Functional error of the speed sensor component for the intermediate shaft",
      "5240": "Signal / speed pulse C3 V is missing",
      "5243": "Speed signal / speed pulse C3 V has a malfunction",
      "5340": "Signal from rotation sensor B99 is missing",
      "5343": "Functional error of component B99",
      "8091": "No speed",
      "8092": "Transfer case incorrectly parameterized or the parameterization process was not carried out",
      "8093": "Invalid gearbox type",
      "8094": "Calculated direction of travel is not plausible",
      "8095": "Clutch position: minimum agreed parameter not reached",
      "8096": "Clutch position: maximum agreed parameter exceeded"
    },
    "HPS": {
      "0160": "CAN data bus functional failure",
      "0161": "CAN bus: communication interrupted",
      "0162": "CAN connection to FR control unit interrupted.",
      "0163": "CAN connection to INS control unit interrupted.",
      "0164": "CAN connection to MR control unit interrupted.",
      "1012": "Internal fault in HPS control unit (hydropneumatic actuation)",
      "1013": "Internal fault in HPS control unit (hydropneumatic actuation)",
      "1101": "Increased voltage at terminal 30",
      "1102": "Undervoltage at terminal 30",
      "1301": "Increased voltage at terminal 15",
      "1302": "Undervoltage at terminal 15",
      "2005": "Power supply pressure sensors is faulty due to an open circuit or short to ground or the signal wire is faulty has an open circuit.",
      "2006": "The power supply or signal wire of the pressure sensors is faulty due to a short to positive.",
      "3003": "The control wires or ground common wire of the solenoid valves are faulty due to an open circuit.",
      "3006": "The control wires or ground common wire of the solenoid valves are faulty due to a short to positive.",
      "3104": "The control wires to the solenoid valves are faulty due to a short to ground.",
      "3204": "The ground common wire of the solenoid valves is faulty due to a short to ground."
    },
    "HZR": {
      "0101": "Internal sensor has a short circuit to ground",
      "0103": "Internal sensor has a short circuit to positive or an open circuit",
      "0201": "Outdoor sensor has a short circuit to ground",
      "0203": "Outdoor sensor has a short circuit to positive or an open circuit",
      "0301": "Heat exchanger sensor has a short circuit to ground",
      "0303": "Heat exchanger sensor has a short circuit to positive or an open circuit",
      "0402": "Heating valve has a short circuit to ground",
      "0404": "Heating valve has a short circuit to positive or an open circuit",
      "0501": "Evaporator sensor has a short circuit to ground",
      "0503": "Evaporator sensor has a short circuit to positive or an open circuit",
      "0604": "Compressor clutch has a short circuit short circuit to positive or open circuit"
    },
    "INS": {
      "0101": "The power supply of the sensor ‘Residual pressure in the brake circuit T’ has a short circuit to ground.",
      "0102": "The power supply of the sensor ‘Residual pressure in the brake circuit T’ has a short circuit to positive.",
      "0104": "The value of the signal input of the sensor ‘System pressure in the brake circuit G’ is below the range.",
      "0105": "The range of the signal input of the sensor ‘System pressure in the brake circuit G’ is exceeded.",
      "0201": "The power supply of the sensor ‘Residual pressure in the brake circuit 2’ has a short circuit to ground.",
      "0202": "The power supply of the sensor ‘Residual pressure in the brake circuit 2’ has a short circuit to positive.",
      "0204": "The value of the signal input of the sensor ‘System pressure in the brake circuit 2’ is below the range.",
      "0205": "The range of the signal input of the sensor ‘System pressure in the brake circuit circuit 2’.",
      "0301": "Cabin unlock has a short circuit to ground.",
      "0308": "Cabin unlock has an open circuit or a short circuit to positive.",
      "0508": "Fuel level sensor has an open circuit or a short circuit to positive.",
      "0607": "Input ‘Terminal W’ has an open circuit or a short circuit to ground.",
      "0901": "Wire K has a short circuit to ground.",
      "1020": "Vehicle CAN bus faulty",
      "1100": "State of digital input X418/18 ‘Truck1 left turn signal indicator’ is invalid.",
      "1101": "State of digital input X418/18 ‘Truck1 right turn signal indicator’ is invalid.",
      "1102": "State of digital input X118/15 ‘Left trailer turn signal indicator’ is invalid.",
      "1103": "The state of digital input X118/3 ‘Right trailer turn signal indicator’ is invalid.",
      "1104": "The state of digital input X218/1 ‘Airbag indicator lamp’ is invalid.",
      "1105": "The state of digital input X318/5 ‘High beam’ is invalid.",
      "1106": "The state of digital input X3 18/8 ‘Terminal 58’ is invalid.",
      "1107": "The state of digital input X318/13 ‘Reserve’ is invalid.",
      "1108": "The state of digital input X418/3 ‘Differential lock on 1st rear axle’ is invalid.",
      "1109": "The state of digital input X418/4 ‘Differential lock on 2nd rear axle’ is invalid.",
      "1110": "The state of digital input X418/10 ‘Differential lock on the 1st front axle’ is invalid.",
      "1111": "The state of digital input X418/11 ‘Crawl gear’ is invalid.",
      "1112": "The state of digital input X418/2 ‘Rear center differential lock’ is invalid.",
      "1113": "The state of digital input X418/12 ‘Transfer case 1 center differential lock’ is invalid.",
      "1114": "The state of digital input X418/1 ‘Transfer case in neutral position’ is invalid.",
      "1115": "The state of digital input X418/13 ‘Power take-off mechanisms’ is invalid.",
      "1116": "The state of digital input X318/7 ‘Stop brake’ is invalid.",
      "1117": "State of digital input X318/14 ‘Secondary consumers’ is invalid.",
      "1118": "State of digital input X3 18/9 ‘System pressure in circuit 3’ is invalid.",
      "1119": "State of digital input X418/17 ‘Trailer ABS malfunction’ is invalid.",
      "1120": "The state of digital input X418/14 ‘Unlock driver's cab left’ is invalid.",
      "1121": "The state of digital input X418/15 ‘Unlock driver's cab right’ is invalid.",
      "1122": "The state of digital input X418/6 ‘Tipper monitoring indicator lamp’ is invalid.",
      "1123": "The state of digital input X418/7 ‘Lamp fault monitoring’ is invalid.",
      "1124": "The state of digital input X418/16 ‘Power steering oil level’ is invalid.",
      "1125": "The state of digital input X318/15 ‘Power steering’ is invalid.",
      "1126": "The state of digital input X318/6 ‘Door limit switch’ is invalid.",
      "1127": "Status of digital input X418/5 ‘Washer fluid reserve volume’ is invalid.",
      "1128": "Status of digital input X418/8 ‘Seat belt indicator’ is invalid.",
      "1129": "Status of digital input X218/2 ‘Reserve’ is invalid.",
      "1137": "Status of digital input X118/12 ‘Reserve’ is invalid.",
      "1138": "Status of digital input X218/10 ‘Terminal 15R’ is invalid.",
      "1139": "Status of digital input X218/11 ‘Reserve’ is invalid.",
      "1140": "Status of digital input X218/12 ‘Cross-shaped rocker switch UP’ is invalid.",
      "1432": "Internal error in control unit",
      "1520": "The CAN bus to the tachograph has failed.",
      "1903": "Terminal 15 has an open circuit.",
      "1941": "Increased voltage at terminal 30",
      "1942": "Increased voltage at terminal 30",
      "2515": "The text file is missing in the instrument cluster",
      "3002": "The FR control unit has failed.",
      "3003": "The FPS control unit has failed",
      "3005": "The SPA (Lane Keeping Assistance) control unit has failed.",
      "3006": "The PFA (Particulate Filter) control unit has failed.",
      "3007": "The FLA (Ignition System) control unit has failed.",
      "3009": "The GS (Gear Control) control unit has failed.",
      "З010": "The AGN (Automatic The commercial vehicle gearbox has failed.",
      "3013": "The WSK control unit (torque converter clutch) has failed.",
      "3014": "The ABS control unit has failed.",
      "3015": "The RS control unit (retarder) has failed.",
      "3017": "The NR control unit (level control) has failed.",
      "3020": "The ZL control unit (steering mechanism) has failed.",
      "3021": "The INS control unit (instrument cluster) has failed.",
      "3024": "The WS control unit (maintenance system) has failed.",
      "3026": "The PTO control unit (communication connector) has failed.",
      "3027": "The GW control unit (gateway) has failed.",
      "3030": "The KWS control unit has failed.",
      "3031": "The HPS control unit (hydropneumatic actuation) has failed.",
      "3033": "The TOO control unit (tachograph) has failed.",
      "3034": "The LWS control unit (steering wheel angle sensor) has failed.",
      "3036": "The BS control unit (brake system control) has failed.",
      "3037": "The RDK control unit tire pressure monitoring system has failed.",
      "3038": "The AG control unit has failed.",
      "3040": "The MR control unit has failed.",
      "3044": "The EDW control unit (anti-theft alarm system) has failed.",
      "3046": "The PSM control unit (parameterizable special module) has failed.",
      "3049": "The ART control unit (Tempomat) has failed.",
      "3054": "The NOX control unit has failed.",
      "3057": "NRN Control Unit failed.",
      "3059": "Navigation Control Unit failed.",
      "3060": "TP Control Unit (Telematik Platform) failed.",
      "3062": "Audio Module Control Unit failed.",
      "3066": "FFS Control Unit failed.",
      "3105": "AN 1 Control Unit failed.",
      "3106": "AN2 Control Unit failed.",
      "3107": "AFI3 Control Unit failed.",
      "3108": "AN4 Control Unit failed.",
      "3109": "AFI5 Control Unit failed.",
      "3110": "AUF Control Unit (Cab Electronics) failed.",
      "3620": "Condensation Sensor failed",
      "3720": "Brake lining wear indicator failed",
      "4002": "Non-parameterizable FR control unit detected.",
      "4003": "Non-parameterizable FPS control unit detected.",
      "4005": "Non-parameterizable SPA (Lane Keeping Assist) control unit detected.",
      "4006": "Non-parameterizable PFA (diesel particulate filter) control unit detected.",
      "4007": "Non-parameterizable FLA (ignition system) control unit detected.",
      "4008": "Non-parameterizable KS (gearbox control) control unit detected.",
      "4009": "Non-parameterizable GS (gear control) control unit detected.",
      "4010": "Non-parameterizable AGN control unit detected.",
      "4013": "Non-parameterizable WSK control unit detected.",
      "4014": "Non-parameterizable ABS control unit is recognized.",
      "4015": "Non-parameterizable RS control unit (retarder control) is recognized.",
      "4017": "Non-parameterizable NR control unit (level control) is recognized.",
      "4020": "Non-parameterizable ZL control unit (steering gear) is recognized.",
      "4021": "Non-parameterizable INS control unit is recognized.",
      "4024": "Non-parameterizable WS control unit (service system) is recognized.",
      "4026": "Non-parameterizable PTO control unit (communication interface) is recognized.",
      "4027": "Non-parameterizable GW control unit (gateway) is recognized.",
      "4030": "Non-parameterizable KWS control unit is recognized.",
      "4031": "Non-parameterizable HPS control unit (hydropneumatic switch-on) is detected.",
      "4033": "Non-parameterizable control unit TOO (tachograph) is detected.",
      "4034": "Non-parameterizable control unit LWS (steering wheel angle sensor) is detected.",
      "4036": "Non-parameterizable control unit BS (brake system control) is detected.",
      "4037": "Non-parameterizable control unit RDK (tyre pressure monitoring system) is detected.",
      "4038": "Non-parameterizable control unit AG is detected.",
      "4040": "Non-parameterizable control unit MR (engine control) is detected.",
      "4044": "Non-parameterizable control unit EDW (anti-theft alarm system) is detected.",
      "4046": "Non-parameterizable control unit PSM (parameterizable special module) is detected.",
      "4049": "Non-parameterizable control unit ART (Tempomat) is detected.",
      "4054": "Non-parameterizable control unit NOX is detected.",
      "4057": "Non-parameterizable control unit NRN is detected.",
      "4059": "Non-parameterizable control unit navigation system is detected.",
      "4060": "Non-parameterizable control unit TP (Telematik platform) is detected.",
      "4062": "Non-parameterizable control unit audio module is detected.",
      "4066": "Non-parameterizable control unit FFS is detected.",
      "4105": "Non-parameterizable control unit ‘trailer 1’ is detected.",
      "4106": "Non-parameterizable control unit ‘trailer 2’ is detected.",
      "4107": "Non-parameterizable control unit ‘trailer 3’ is detected.",
      "4108": "Non-parameterizable control unit ‘trailer 4’ recognized.",
      "4109": "Non-parameterizable control unit ‘trailer 5’ recognized.",
      "4110": "A non-parameterizable AUF control unit (cabin electronics) is detected.",
      "4202": "The FR control unit responds to a diagnostic request although it is parameterized as non-diagnosable.",
      "4203": "The FPS control unit responds to a diagnostic request although it is parameterized as non-diagnosable.",
      "4205": "The SPA control unit (lane keeping system) responds to a diagnostic request although it is parameterized as non-diagnosable.",
      "4206": "The PFA control unit (diesel particulate filter) responds to a diagnostic request although it is parameterized as non-diagnosable.",
      "4207": "The FLA control unit (ignition system) responds to a diagnostic request although it is parameterized as non-diagnosable.",
      "4208": "The KS control unit responds to a diagnostic request although it is parameterized as non-diagnosable.",
      "4209": "The GS control unit responds to a diagnostic request although it is parameterized as non-diagnosable.",
      "4210": "AGN control unit responds to diagnostic request although it is parameterized as non-diagnostic.",
      "4213": "WSK control unit (torque converter clutch) responds to diagnostic request although it is parameterized as non-diagnostic.",
      "4214": "ABS control unit responds to diagnostic request although it is parameterized as non-diagnostic.",
      "4215": "RS control unit (retarder control) responds to diagnostic request although it is parameterized as non-diagnostic.",
      "4217": "NR control unit (level control) responds to diagnostic request although it is parameterized as non-diagnostic.",
      "4220": "ZL control unit (steering gear) responds to diagnostic request although it is parameterized as non-diagnostic.",
      "4221": "INS control unit responds to diagnostic request although it is parameterized as non-diagnostic.",
      "4224": "WS control unit (maintenance system) responds to a diagnostic request, although it is parameterized as non-diagnostic.",
      "4226": "The PTO control unit responds to a diagnostic request, although it is parameterized as non-diagnostic.",
      "4227": "The GW control unit (gateway) responds to a diagnostic request although it is parameterized as non-diagnostic.",
      "4230": "The KWS control unit responds to a diagnostic request although it is parameterized as non-diagnostic.",
      "4231": "The FIPS control unit responds to a diagnostic request although it is parameterized as non-diagnostic.",
      "4233": "The TCO control unit responds to a diagnostic request although it is parameterized as non-diagnostic.",
      "4234": "The LWS control unit (steering wheel angle) responds to a diagnostic request although it is parameterized as non-diagnostic.",
      "4236": "The BS control unit responds to a diagnostic request although it is parameterized as non-diagnostic.",
      "4237": "The RDK control unit (tire pressure monitoring system) responds to a diagnostic request although it is parameterized as non-diagnostic.",
      "4238": "The AG control unit responds to a diagnostic request although it is parameterized as undiagnosable.",
      "4240": "The MR control unit (engine control) responds to a diagnostic request, although it is parameterized as undiagnosable.",
      "4244": "The EDW control unit (anti-theft alarm system) responds to a diagnostic request, although it is parameterized as undiagnosable.",
      "4246": "The PSM control unit (parameterizable special module) responds to a diagnostic request, although it is parameterized as undiagnosable.",
      "4249": "The ART control unit (Tempomat) responds to a diagnostic request, although it is parameterized as undiagnosable.",
      "4254": "The OX control unit responds to a diagnostic request, although it is parameterized as undiagnosable.",
      "4257": "The NRN control unit responds to a diagnostic request, although it is parameterized as undiagnosable.",
      "4259": "The navigation control unit responds to a diagnostic request, although it is parameterized as undiagnosable.",
      "4260": "The TP control unit (platform Telematic) responds to diagnostic request, although it is parameterized as non-diagnostic.",
      "4262": "The audio module control unit responds to diagnostic request, although it is parameterized as non-diagnostic.",
      "4266": "The FFS control unit responds to diagnostic request, although it is parameterized as non-diagnostic.",
      "4305": "The ANN 1 control unit responds to diagnostic request, although it is parameterized as non-diagnostic.",
      "4306": "The AN2 control unit responds to diagnostic request, although it is parameterized as non-diagnostic.",
      "4307": "The ANZ control unit responds to diagnostic request, although it is parameterized as non-diagnostic.",
      "4308": "The AFI4 control unit responds to diagnostic request, although it is parameterized as non-diagnostic.",
      "4309": "The AFI5 control unit responds to diagnostic request, although it is parameterized as non-diagnostic.",
      "4310": "The AUF (cabin electronics) control unit responds to diagnostic request, although it is parameterized as non-diagnostic."
    },
    "KSA": {
      "1010": "Internal error in the control unit",
      "1011": "Control unit EEPROM malfunction",
      "1101": "Terminal 30: overvoltage",
      "1102": "Terminal 30: undervoltage",
      "2021": "The wire to the FB interface has a short circuit to ground (plausibility during transmission).",
      "2121": "The wire to the SD interface has a short circuit to ground.",
      "2122": "The wire to the SD interface has a short circuit to positive.",
      "2221": "The wire to the GGVS output has a short circuit to ground.",
      "2222": "The wire to the GGVS output has a short circuit to positive.",
      "3021": "The wire to the driver's door actuator ‘M+’ has a short circuit to ground.",
      "3022": "The wire to the driver's door actuator 'M+' has a short circuit to positive.",
      "3121": "The wire to the driver's or front passenger's door actuator 'M-' (interior lighting) has a short circuit to ground.",
      "3122": "The wire to the driver's or front passenger's door actuator 'M-' (interior lighting) has a short circuit to positive.",
      "3221": "The wire to the front passenger's door actuator 'M+' has a short circuit to ground.",
      "3222": "The wire to the front passenger's door actuator 'M+' has a short circuit to positive.",
      "3321": "The wire to the interior 'Lock' button has a short circuit to ground.",
      "3421": "The wire to the interior 'Unlock' button has a short circuit to ground.",
      "4021": "The wire to the driver's door 'M+' window regulator has a short circuit to ground.",
      "4022": "The wire to the driver's door 'M+' window regulator has a short circuit to positive.",
      "4121": "The wire to the driver's door 'M-' window regulator has a short circuit to ground.",
      "4122": "The wire to the driver's door 'M-' window regulator has a short circuit to positive.",
      "4221": "The wire to the front passenger door 'M+' window regulator has a short circuit to ground.",
      "4222": "The wire to the front passenger door 'M+' window regulator has a short circuit to positive.",
      "4321": "The wire to the front passenger door 'Motor Negative' window regulator has a short circuit to ground.",
      "4322": "The wire to the front passenger door 'Motor Negative' window regulator has a short circuit to positive.",
      "4421": "The wire to the the ‘Driver’s door window OPEN’ button has a short circuit to ground.",
      "4521": "The wire to the ‘Driver’s door window CLOSE’ button has a short circuit to ground.",
      "4621": "The wire to the ‘Front passenger’s door window OPEN’ button has a short circuit to ground.",
      "4721": "The wire to the ‘Front passenger’s door window CLOSE’ button has a short circuit to ground.",
      "4821": "The wire to the driver’s door lock switch has a short circuit to ground.",
      "5040": "Driver’s door hall: no signal.",
      "5140": "Front passenger’s door hall: no signal.",
      "5221": "The wire to the Hall sensor power supply has a short circuit to ground.",
      "5510": "Incorrect registration of driver’s door current",
      "5610": "Incorrect registration of the front passenger door current",
      "6020": "The wire to the driver's door window lifter has an open circuit.",
      "6022": "The wire to the driver's door window lifter has a short circuit to positive.",
      "6051": "The driver's door window lifter drive end stop is faulty.",
      "6120": "The wire to the front passenger door window lifter has an open circuit.",
      "6122": "The wire to the front passenger door window lifter has a short circuit to positive.",
      "6151": "The front passenger door window lifter drive end stop is faulty."
    },
    "MR": {
      "0101": "CAN-L connection to FR defective",
      "0102": "Data from FR control unit (ride control) incorrect",
      "0104": "CAN connection to FR defective",
      "0149": "CAN parameterization error",
      "0204": "CAN High line to frame SCR module (Euro 4 or Euro 5) defective.",
      "0308": "Crankshaft position sensor, short circuit to ground",
      "0309": "Crankshaft position sensor, open circuit",
      "0310": "Crankshaft position sensor: signal too weak",
      "0311": "Crankshaft position sensor: incorrect synchronization of crankshaft and camshaft signals.",
      "0312": "Crankshaft position sensor: no signal",
      "0313": "Crankshaft position sensor: incorrect polarity.",
      "0408": "Camshaft position sensor, short circuit to ground",
      "0409": "Camshaft position sensor, open circuit",
      "0412": "Camshaft position sensor: no signal",
      "0413": "Camshaft position sensor: incorrect polarity",
      "0530": "Rotation speed sensor",
      "0612": "No fan speed signal.",
      "0631": "Fan speed too low.",
      "0722": "Temperature after catalytic converter too high.",
      "0782": "Catalytic converter missing.",
      "0788": "Temperature before catalytic converter too high (threshold 1 exceeded).",
      "0789": "Temperature before catalytic converter too high (threshold 2 exceeded).",
      "0797": "Pre-catalyst temperature too high (reduced engine power).",
      "0815": "Pre-catalyst temperature sensor has an open circuit or short circuit to positive.",
      "0816": "Pre-catalyst temperature sensor has a short circuit to ground.",
      "0915": "Behind catalytic converter temperature sensor has an open circuit or short circuit to positive.",
      "0916": "Behind catalytic converter temperature sensor has a short circuit to ground.",
      "1015": "Oil temperature sensor has exceeded the measuring range (short circuit to positive, open circuit).",
      "1016": "Oil temperature sensor has not reached the minimum measuring range (short circuit to ground).",
      "1115": "Fuel temperature sensor has exceeded the measuring range (short circuit to positive, open circuit).",
      "1116": "Fuel temperature sensor has not reached the minimum measuring range (short circuit to ground).",
      "1215": "Combined sensor ‘Boost pressure and charge air temperature’: Temperature sensor, measuring range exceeded (short circuit to positive, open circuit)",
      "1216": "Combined sensor ‘Boost pressure and charge air temperature’: Temperature sensor, minimum measuring range not reached (short circuit to ground)",
      "1315": "Atmospheric pressure sensor, measuring range exceeded (short circuit to positive, open circuit).",
      "1316": "Atmospheric pressure sensor, minimum value of measuring range not reached (short circuit to ground).",
      "1415": "Combined sensor ‘Boost pressure and charge air temperature’: Pressure sensor, measuring range exceeded (short circuit to positive, open circuit)",
      "1416": "Combined sensor ‘Boost pressure and charge air temperature’: Pressure sensor, minimum not reached measuring range (short circuit to ground)",
      "1417": "Combined sensor ‘boost pressure and charge air temperature’: pressure sensor, measured value is invalid",
      "1515": "Coolant temperature sensor, measuring range exceeded (short circuit to positive, open circuit).",
      "1516": "Coolant temperature sensor, minimum value of measuring range not reached (short circuit to ground).",
      "1615": "Oil pressure sensor, measuring range exceeded (short circuit to positive, open circuit).",
      "1616": "Oil pressure sensor, minimum value of measuring range not reached (short circuit to ground).",
      "1617": "Oil pressure sensor, measured value is invalid",
      "1715": "Combined input: measuring range exceeded",
      "1716": "Combined input: minimum measuring range not reached",
      "1717": "Combined input: invalid signal",
      "1818": "Boost circuit faulty",
      "1820": "Boost pressure exceeded",
      "1822": "Blast air temperature exceeded",
      "1873": "Turbocharger speed has a disturbance in uniform movement.",
      "1874": "Blast air pressure control setpoint deviation too large.",
      "1876": "Boost pressure insufficient for braking mode.",
      "1878": "Boost circuit defective",
      "1917": "Measured value of fuel pressure sensor implausible.",
      "2017": "Measured value of oil pressure sensor implausible.",
      "2020": "Oil pressure too low.",
      "2021": "Oil pressure too low.",
      "2026": "Engine oil level too high or too low.",
      "2122": "Coolant temperature too high.",
      "2219": "Terminal 15 of block MR or FR control unit has an open circuit.",
      "2319": "Terminal 50 of the MR or FR control unit has an open circuit.",
      "2415": "Differential fuel pressure sensor has an open circuit.",
      "2416": "Differential fuel pressure sensor has a short circuit to positive, ground.",
      "2509": "Oil level sensor: open circuit",
      "2515": "Oil level sensor, short circuit to positive, measuring range exceeded",
      "2516": "Oil level sensor, short circuit to ground, minimum measuring range not reached",
      "2517": "Oil level sensor: measured value is invalid",
      "2612": "Turbocharger speed sensor has an open circuit, short circuit to ground, short circuit to positive.",
      "2615": "Turbocharger speed sensor has a short circuit to positive, open circuit.",
      "2616": "Turbocharger speed sensor has a short circuit to ground.",
      "2712": "No speed signal from the generator (timeout). or Turbocharger speed sensor has an open circuit, short circuit to ground, short circuit to positive (turbocharger 2).",
      "2804": "NOx sensor has a communication problem.",
      "2815": "NOx sensor has a short circuit to positive, open circuit.",
      "2816": "NOx sensor has a short circuit to ground.",
      "2971": "Nitrogen oxide emissions too high (threshold 1 exceeded)",
      "2972": "Nitrogen oxide emissions too high (threshold 2 exceeded)",
      "3015": "Fuel pressure sensor, measuring range exceeded (short circuit to positive, open circuit)",
      "3016": "Fuel pressure sensor, minimum measuring range not reached (short circuit to ground)",
      "3115": "Check air temperature sensor 2 has an open circuit.",
      "3116": "Check air temperature sensor 2 has a short circuit.",
      "3215": "EGR temperature sensor has an open circuit.",
      "3216": "EGR temperature sensor has a short circuit.",
      "3332": "EGR temperature sensor: value outside specified range.",
      "3415": "Air humidity sensor has a short circuit to positive, open circuit.",
      "3416": "Air humidity sensor has a short circuit to ground.",
      "3515": "Air temperature sensor has a short circuit to positive, open circuit.",
      "3516": "The air temperature sensor has a short circuit to ground.",
      "3604": "Missing CAN message 'Air temperature'.",
      "3617": "The measured value of the ambient air temperature sensor is implausible.",
      "3706": "The SCR compressed air switch valve has a short circuit to ground.",
      "3707": "The SCR compressed air switch valve has a short circuit to positive.",
      "3709": "The SCR compressed air switch valve has an open circuit.",
      "3817": "The measured values of the temperature sensors on the catalytic converter are implausible.",
      "3906": "The AdBlue pump has a short circuit to ground.",
      "3907": "The AdBlue pump has a short circuit to positive.",
      "3909": "The AdBlue pump has an open circuit.",
      "4024": "Internal error in control unit",
      "4034": "Internal error in control unit",
      "4035": "Internal error in control unit",
      "4036": "Internal error in control unit",
      "4037": "Internal error in control unit",
      "4038": "Internal error in control unit",
      "4039": "Starter control (output stage) defective",
      "4040": "Internal error in control unit",
      "4041": "Internal error in control unit",
      "4047": "Internal error in control unit",
      "4048": "Internal error in control unit",
      "4049": "Invalid parameterization of proportional valves",
      "4050": "Internal error in control unit",
      "4051": "Internal error in control unit",
      "4052": "Internal error in control unit",
      "4053": "Internal error in control unit",
      "4054": "Internal error in control unit",
      "4056": "Internal error in control unit",
      "4058": "The data block in the MR engine control unit (PLD) has been changed.",
      "4092": "Internal error in control unit",
      "4149": "The engine brake is not parameterized correctly.",
      "4200": "Proportional valve 5 has a short circuit to positive.",
      "4201": "Proportional valve 5 has a short circuit to ground.",
      "4202": "Proportional valve 7 has a short circuit to ground.",
      "4203": "Proportional valve 7 has a break circuits.",
      "4204": "Proportional valve 7 has a short circuit to positive.",
      "4205": "Throttle position sensor has a short circuit to positive, open circuit.",
      "4206": "Throttle position sensor has a short circuit to ground.",
      "4207": "Temperature sensor before diesel oxidation catalytic converter has a short circuit to positive, open circuit.",
      "4208": "Temperature sensor before diesel oxidation catalytic converter has a short circuit to ground.",
      "4209": "Temperature sensor after diesel oxidation catalytic converter has a short circuit to positive, open circuit.",
      "4210": "Temperature sensor after diesel oxidation catalytic converter has a short circuit to ground.",
      "4211": "Differential pressure sensor before diesel particulate filter has a short circuit to positive, open circuit circuits.",
      "4212": "The differential pressure sensor before the diesel particulate filter has a short circuit to ground.",
      "4213": "The differential pressure sensor after the diesel particulate filter has a short circuit to positive, open circuit.",
      "4214": "The differential pressure sensor after the diesel particulate filter has a short circuit to ground.",
      "4215": "The differential pressure in the diesel particulate filter is too high.",
      "4216": "The differential pressure in the diesel particulate filter is too low.",
      "4217": "The throttle adjustment deviation is too high.",
      "4218": "The initial setting of the throttle valve has failed.",
      "4219": "The diffuser in the AdBlue dispenser is clogged.",
      "4220": "The dispenser is dirty",
      "4221": "The diffuser heater has an open circuit.",
      "4222": "The diffuser heater has a short circuit to ground.",
      "4223": "The diffuser heater has a short circuit to positive.",
      "4224": "Internal error in the control unit",
      "4225": "The proportional valve bank 1 has a short circuit to positive.",
      "4226": "The proportional valve bank 1 has a short circuit to ground.",
      "4227": "Internal fault in the control unit",
      "4228": "SORT components are missing.",
      "4229": "The measured value of the SORT temperature sensors (pair A) is invalid.",
      "4230": "The measured value of the SORT temperature sensors (pair B) is invalid.",
      "4231": "The particulate filter is not installed.",
      "4232": "The measured The measured value of the differential pressure sensor before the diesel particulate filter is not plausible.",
      "4233": "The measured value of the differential pressure sensor after the diesel particulate filter is not plausible.",
      "4234": "The emission of nitrogen oxides is too high due to an unknown cause (threshold value 2 exceeded)",
      "4235": "The emission of nitrogen oxides is too high due to poor AdBlue quality",
      "4236": "The emission of nitrogen oxides is too high due to insufficient AdBlue dosing",
      "4237": "The measured value of the NOx sensor is not plausible.",
      "4238": "The temperature in the diesel particulate filter is too low.",
      "4239": "Sensor unit 1 in the MR control unit has a short circuit.",
      "4240": "Sensor unit 2 in the MR control unit has a short circuit.",
      "4241": "Sensor unit 1 in the SCR module on frame has a short circuit.",
      "4242": "Sensor block 2 in the SCR module on the frame has a short circuit.",
      "4243": "Sensor block 3 in the SCR module on the frame has a short circuit.",
      "4244": "NOx sensor malfunction",
      "4245": "Component 'NOx sensor' defective.",
      "4246": "Initial nitrogen oxide emissions too high",
      "4247": "Component 'catalytic converter' defective.",
      "4248": "Poor AdBlue quality or insufficient AdBlue dosing",
      "4249": "Nitrogen oxide emissions too high",
      "4415": "The differential pressure sensor before the diesel particulate filter has a short circuit to positive, open circuit.",
      "4416": "The differential pressure sensor before the diesel particulate filter has a short circuit to ground.",
      "4805": "Bank 1 unit injector has a short circuit to positive.",
      "4806": "Bank 1 unit injector return has a short circuit to ground.",
      "4905": "Bank 2 has a short circuit to positive.",
      "4906": "The return of the unit injectors of bank 2 has a short circuit to ground.",
      "5026": "Unit injector of cylinder 1: valve does not open",
      "5027": "Unit injector of cylinder 1: control malfunction",
      "5028": "Unit injector of cylinder 1: short circuit",
      "5126": "Unit injector of cylinder 2: valve does not open",
      "5127": "Unit injector of cylinder 2: control malfunction",
      "5128": "Unit injector of cylinder 2: short circuit",
      "5226": "Unit injector of cylinder 3: valve does not open",
      "5227": "Unit injector of cylinder 3: control malfunction",
      "5228": "Unit injector of cylinder 3: short circuit",
      "5326": "Cylinder 4 injector: valve does not open",
      "5327": "Cylinder 4 injector: control fault",
      "5328": "Cylinder 4 injector: short circuit",
      "5426": "Cylinder 5 injector: valve does not open",
      "5427": "Cylinder 5 injector: control fault",
      "5428": "Cylinder 5 injector: short circuit",
      "5526": "Cylinder 6 injector: valve does not open",
      "5527": "Cylinder 6 injector: control fault",
      "5528": "Cylinder 6 injector: short circuit",
      "5626": "Cylinder 7 injector: valve does not open",
      "5627": "Cylinder 7 pump injector: control fault",
      "5628": "Cylinder 7 pump injector: short circuit",
      "5726": "Cylinder 8 pump injector: valve does not open",
      "5727": "Cylinder 8 pump injector: control fault",
      "5728": "Cylinder 8 pump injector: short circuit",
      "5806": "The AdBlue pipe heater has a short circuit to ground.",
      "5807": "The AdBlue pipe heater has a short circuit to positive.",
      "5809": "The AdBlue pipe heater has an open circuit.",
      "5869": "The AdBlue pipe heater is faulty.",
      "5906": "The AdBlue tank heater solenoid valve has a short circuit to ground.",
      "5907": "The AdBlue tank heating solenoid valve has a short circuit to positive.",
      "5909": "The AdBlue tank heating solenoid valve has an open circuit.",
      "5969": "The AdBlue tank heating valve is defective.",
      "6015": "The AdBlue level sensor has a short circuit to positive, open circuit.",
      "6016": "The AdBlue level sensor has a short circuit to ground.",
      "6029": "The AdBlue tank fill level is too low.",
      "6115": "The AdBlue tank temperature sensor has a short circuit to positive, open circuit.",
      "6116": "The AdBlue tank temperature sensor has a short circuit to ground.",
      "6169": "The ‘AdBlue tank fill level/temperature’ sensor is defective.",
      "6293": "Internal fault in the SCR module on the frame",
      "6327": "OBD lamp activation is faulty.",
      "6409": "The heating flange has an open circuit.",
      "6432": "The heating flange is faulty.",
      "6506": "The oil separator diagnostic cable has a short circuit to ground.",
      "6564": "The oil separator diagnostic cable has an open circuit or short circuit to positive.",
      "6678": "The EGR valve is faulty.",
      "6679": "The temperature difference between the exhaust gases and the coolant is implausible.",
      "6720": "AdBlue pressure too high.",
      "6721": "AdBlue pressure too low.",
      "6770": "The AdBlue pressure drop during pump run-on is too low.",
      "6777": "The AdBlue pump current consumption is too high.",
      "6820": "SCR compressed air pressure too high.",
      "6821": "SCR compressed air pressure too low.",
      "6883": "SCR compressed air system air supply interrupted.",
      "6949": "Parameterization error",
      "6994": "Exhaust gas aftertreatment system is switched off and diagnostic program is active",
      "6995": "Exhaust gas aftertreatment system is switched off and diagnostic program is active",
      "7006": "Proportional valve 1 has a short circuit to ground.",
      "7007": "Proportional valve 1 has a short circuit to positive.",
      "7009": "Proportional valve 1 has an open circuit.",
      "7106": "Solenoid valve 3: fan stage 1 has a short circuit to ground.",
      "7107": "Proportional valve 3 has a short circuit to short circuit to positive.",
      "7109": "Solenoid valve 3: Fan stage 1 has an open circuit.",
      "7112": "Solenoid valve 3: Fan overdrive - no fan speed",
      "7206": "Solenoid valve 4: Fan stage 2 has a short circuit to ground.",
      "7207": "Proportional valve 4 has a short circuit to positive.",
      "7209": "Solenoid valve 4: Fan stage 2 has an open circuit.",
      "7305": "Solenoid valve 2: Decompression valve brake has a short circuit to positive.",
      "7306": "Solenoid valve 2: Decompression valve brake has a short circuit to ground.",
      "7307": "Proportional valve 2 has a short circuit to positive.",
      "7309": "Proportional valve 2 has an open circuit.",
      "7317": "Solenoid valve 2: decompression valve brake has an open circuit or short circuit to ground.",
      "7405": "Proportional valve 5 has a short circuit to positive.",
      "7408": "Proportional valve 5 has a short circuit to ground.",
      "7542": "Battery voltage too high",
      "7543": "Battery voltage too low",
      "7606": "Proportional valve 6 has a short circuit to ground.",
      "7609": "Proportional valve 6 has an open circuit.",
      "7705": "Proportional valve bank 1 has a short circuit to positive.",
      "7708": "Proportional valve bank 1 has a short circuit to ground.",
      "7805": "Proportional valve bank 2 has a short circuit to short to positive.",
      "7808": "Bank 2 proportional valve has a short to ground.",
      "7905": "SCR module bank proportional valve on frame has a short to positive.",
      "7908": "SCR module bank proportional valve on frame has a short to ground.",
      "8005": "Terminal 50 to primary relay (short to positive)",
      "8008": "Terminal 50 to primary relay (short to ground)",
      "8009": "Terminal 50 to primary relay (open circuit)",
      "8033": "Control relay faulty",
      "8039": "Starter control (output stage) faulty",
      "8086": "Starter not engaging",
      "8106": "SCR compressed air shut-off valve has a short circuit to ground.",
      "8107": "The SCR compressed air shut-off valve has a short circuit to positive.",
      "8109": "The SCR compressed air shut-off valve has an open circuit.",
      "8206": "The AdBlue metering valve has a short circuit to ground.",
      "8207": "The AdBlue metering valve has a short circuit to positive.",
      "8209": "The AdBlue metering valve has an open circuit.",
      "8315": "The AdBlue temperature sensor has a short circuit to positive, open circuit.",
      "8316": "The AdBlue temperature sensor has a short circuit to ground.",
      "8415": "The AdBlue pressure sensor has a short circuit to positive, open circuit.",
      "8416": "The AdBlue pressure sensor has a short circuit to ground.",
      "8417": "The measured value of the AdBlue pressure sensor is implausible.",
      "8515": "The SCR compressed air sensor has a short circuit to positive, open circuit.",
      "8516": "The SCR compressed air sensor has a short circuit to ground.",
      "8517": "The measured value of the SCR compressed air pressure sensor is implausible.",
      "8690": "The current AdBlue consumption is too high.",
      "8691": "Current AdBlue consumption too low.",
      "8790": "Average AdBlue consumption too high.",
      "8791": "Average AdBlue consumption too low.",
      "8896": "AdBlue pressure implausible.",
      "8906": "SCR compressed air shut-off valve has a short circuit to ground.",
      "8907": "SCR compressed air shut-off valve has a short circuit to positive.",
      "8909": "SCR compressed air shut-off valve has an open circuit.",
      "9044": "Cylinder 1 unit injector: idle speed uniformity adjustment in the limitation area",
      "9045": "Cylinder 1 unit injector: cylinder-specific correction in the limitation area",
      "9144": "Cylinder 2 unit injector: idle speed uniformity adjustment idle speed in the limitation area",
      "9145": "Cylinder 2 unit injector: individual cylinder correction in the limitation area",
      "9244": "Cylinder 3 unit injector: idle speed uniformity adjustment in the limitation area",
      "9245": "Cylinder 3 unit injector: individual cylinder correction in the limitation area",
      "9344": "Cylinder 4 unit injector: idle speed uniformity adjustment in the limitation area",
      "9345": "Cylinder 4 unit injector: individual cylinder correction in the limitation area",
      "9444": "Cylinder 5 unit injector: idle speed uniformity adjustment in the limitation area",
      "9445": "Cylinder 5 unit injector: individual cylinder correction in the limitation area",
      "9544": "Cylinder 6: idle speed uniformity adjustment in the limitation area",
      "9545": "Cylinder 6 pump injector: individual cylinder correction in the limitation area",
      "9645": "Cylinder 7 pump injector; individual cylinder correction in the limitation area",
      "9744": "Cylinder 8 pump injector: idle speed uniformity adjustment in the limitation area",
      "9745": "Cylinder 8 pump injector; Individual cylinder correction in the limitation zone",
      "9846": "Individual cylinder correction failure",
      "9960": "Too many keys",
      "9961": "Immobilizer protection function activated, MR control unit locked",
      "9962": "Immobilizer protection function activated in MR unit",
      "9963": "Transponder code missing on engine CAN data bus",
      "9964": "Transponder code missing on terminal 50",
      "9965": "Incorrect transponder key"
    },
    "MTCO": {
      "0000": "Tachograph positioning faulty.",
      "0004": "Power supply interruption",
      "1000": "CAN fault",
      "1100": "CAN fault",
      "1200": "Internal error",
      "1400": "Tachograph calibration incorrect.",
      "1500": "Control panel fault",
      "1600": "Control panel fault",
      "1704": "CAN connection to INS (instrument cluster) faulty",
      "3408": "Speed sensor faulty",
      "3504": "Speed sensor faulty",
      "4804": "Speed output faulty",
      "8000": "Trip without tachograph",
      "8100": "Driver 1 tachograph missing.",
      "8200": "Driver 2 tachograph missing.",
      "8300": "Synchronization cannot be started.",
      "9000": "Tachogram positioning is impaired.",
      "9600": "Sliding compartment operation is impaired.",
      "9700": "Speed recording fault",
      "9800": "Recording system fault",
      "9900": "Recording system fault"
    },
    "NR": {
      "0160": "IES CAN bus: CAN bus is OFF",
      "0161": "IES CAN bus: communication interruption",
      "0162": "IES CAN bus: speed signal missing (FR and ABS/BS).",
      "0163": "IES CAN bus: ’Service brake system 1 (FR)’ signal missing.",
      "0164": "IES CAN bus: ’Engine speed’ signal missing (FR).",
      "0165": "IES-CAN: ’Residual pressure in circuit T’ signal missing (INS).",
      "0166": "IES-CAN: ’Residual pressure in circuit 2’ signal missing (INS).",
      "0167": "IES CAN bus: ’Supply voltage, bit information’ signal missing (INS).",
      "0168": "IES CAN bus: ’Voltage power supply, byte information’ (INS).",
      "0169": "CAN IES: Unable to detect cornering",
      "0170": "CAN IES: No specified brake pressure.",
      "0171": "CAN 1ES: Unable to detect cornering",
      "1010": "Internal error in control unit",
      "1012": "Control unit: Checksum of ECU-specific data",
      "1013": "Control unit: Checksum of parameters",
      "1014": "Incorrect checksum of displacement sensor calibration data.",
      "1015": "Incorrect checksum of pressure sensor calibration data.",
      "1016": "Incorrect checksum of axle load calibration data.",
      "1017": "Incorrect checksum of permissible axle loads.",
      "1101": "Excessive voltage at terminal 30",
      "1102": "Low voltage at terminal 30",
      "1301": "High voltage at terminal 15",
      "1302": "Low voltage at terminal 15",
      "1303": "Terminal 15: out of valid voltage range",
      "2030": "Control panel, data, open circuit",
      "2031": "Control panel, data, short circuit to ground",
      "2032": "Control panel, data, short circuit to positive",
      "2130": "Control panel, clock, open circuit",
      "2131": "Control panel, clock, short circuit to ground",
      "2132": "Control panel, clock, short circuit to positive",
      "2230": "Control panel +* UB. open circuit",
      "2231": "Control panel + UB, short circuit to ground",
      "2232": "Control panel + UB, short circuit to positive",
      "3020": "Solenoid valve 3/2, filling, open circuit",
      "3021": "Solenoid valve 3/2, filling, short circuit to ground",
      "3022": "Solenoid valve 3/2, filling, short circuit to positive",
      "3120": "Solenoid valve 2/2, left drive axle, open circuit",
      "3121": "Solenoid valve 2/2, left drive axle, short circuit to ground",
      "3122": "Solenoid valve 2/2, left drive axle, short circuit to positive",
      "3220": "Solenoid valve 2/2, right drive axle, open circuit",
      "3221": "Solenoid valve 2/2, right drive axle, short circuit to ground",
      "3222": "Solenoid valve 2/2, drive axle right, short circuit to positive",
      "3320": "Solenoid valve 3/3, lowering 3. bridge, open circuit",
      "3321": "Solenoid valve 3/3, lowering 3. bridge, short circuit to ground",
      "3322": "Solenoid valve 3/3, lowering 3. bridge, short circuit to positive",
      "3420": "Solenoid valve 3/3, raising 3. bridge, open circuit",
      "3421": "Solenoid valve 3/3, raising 3. bridge, short circuit to ground",
      "3422": "Solenoid valve 3/3, raising 3. bridge, short circuit to positive",
      "3520": "Solenoid valve 2/2, front axle, open circuit",
      "3521": "Solenoid valve 2/2, front axle, short circuit to ground",
      "3522": "2/2 solenoid valve, front axle, short circuit to positive",
      "3620": "Return solenoid valve, open circuit",
      "3621": "Return solenoid valve, short circuit to ground",
      "3622": "Return solenoid valve, short circuit to positive",
      "4040": "Travel sensor, left drive axle, open circuit",
      "4041": "Left Drive Axle Travel Sensor Short to Ground",
      "4042": "Left Drive Axle Travel Sensor Short to Positive",
      "4043": "Left Drive Axle Travel Sensor: Coil Nominal Resistance Malfunction",
      "4140": "Right Drive Axle Travel Sensor Open Circuit",
      "4141": "Right Drive Axle Travel Sensor Short to Ground",
      "4142": "Right Drive Axle Travel Sensor Short to Positive",
      "4143": "Right Drive Axle Travel Sensor: Coil Nominal Resistance Malfunction",
      "4240": "Drive Axle Travel Sensor Open Circuit",
      "4241": "Drive Axle Travel Sensor Short to Ground",
      "4242": "Drive Axle Travel Sensor Short to plus",
      "4243": "Front axle displacement sensor: coil nominal resistance malfunction",
      "5040": "Pressure sensor, left drive axle, open circuit",
      "5041": "Pressure sensor, left drive axle, short circuit to ground",
      "5042": "pressure, left drive axle, short circuit to positive",
      "5140": "Pressure sensor, right drive axle, open circuit",
      "5141": "Pressure sensor, right drive axle, short circuit to ground",
      "5142": "Pressure sensor, right drive axle, short circuit to positive",
      "5240": "Pressure sensor, drive axle, open circuit",
      "5241": "Pressure sensor, drive axle, short circuit to ground",
      "5242": "Pressure sensor, drive axle, short circuit to positive",
      "5340": "Pressure sensor + UB, open circuit",
      "5341": "Pressure sensor + UB, short circuit to ground",
      "5342": "Pressure sensor + UB, short circuit to positive",
      "6020": "The supply line to the front axle WR proportional valve has an open circuit.",
      "6021": "The supply line to the front axle WR proportional valve has a short circuit to ground.",
      "6022": "The supply line to the front axle WR proportional valve has a short circuit to positive.",
      "6023": "The specified current at the front axle WR proportional valve is not reached.",
      "6120": "The supply line to the 1st axle WR proportional valve has an open circuit.",
      "6121": "The supply line to the rear axle WR proportional valve 1 has a short circuit to ground.",
      "6122": "The supply wire to the proportional valve WR 1. of the rear axle has a short circuit to positive.",
      "6123": "The rated current at the proportional valve WR 1. of the rear axle is not reached.",
      "6220": "The supply wire to the proportional valve WR 2. of the axle has an open circuit.",
      "6221": "The supply wire to the proportional valve WR 2. of the rear axle has a short circuit to ground.",
      "6222": "The supply wire to the proportional valve WR 2. of the rear axle has a short circuit to positive.",
      "6223": "The rated current at the proportional valve WR 2. of the rear axle is not reached.",
      "6320": "The WR check valve has an open circuit.",
      "6321": "The WR check valve has a short circuit to ground.",
      "6322": "WR valve has a short circuit to positive."
    },
    "PSM": {
      "0100": "The external control unit for monitoring the temperature in the cabin or trailer has detected a fault. The information is transmitted via the CAN cabin or CAN trailer to the PSM control unit (parameterizable special module).",
      "0101": "The external control unit for recording the temperature in the cabin or trailer does not communicate via the body CAN bus or the trailer CAN bus with the PSM control unit (parameterizable special module).",
      "0160": "Communication failure on the vehicle CAN bus",
      "0161": "Communication failure with the ABS control unit or the BS brake control unit",
      "0162": "Communication failure with the GS control unit (gear control)",
      "0163": "Communication failure with the FR control unit (driving control)",
      "0164": "Communication failure with the INS control unit (instrument cluster)",
      "0200": "The external control unit for monitoring the the fluid level in the cabin or trailer has detected a fault. The information is transmitted via the CAN cabin or CAN trailer to the PSM control unit (parameterizable special module).",
      "0201": "The external control unit for recording the fluid level in the cabin or trailer does not communicate via the body CAN bus or the trailer CAN bus with the PSM control unit (parameterizable special module).",
      "0270": "Single-wire mode of the body CAN bus is not possible.",
      "0271": "The CAN-H wire of the CAN cabin bus is faulty",
      "0272": "The CAN-L wire of the CAN cabin bus is faulty",
      "0300": "The external control unit for monitoring the pressure in the cabin or trailer has detected a fault. The information is transmitted via the CAN cabin or CAN trailer to the PSM control unit (parameterizable special module).",
      "0301": "The external control unit for recording the pressure in the cabin or trailer does not communicate via the CAN bus of the body or the CAN bus of the trailer with the PSM control unit (parameterizable special module).",
      "0370": "Single-wire mode of the CAN bus of the trailer is not possible.",
      "0371": "The CAN-H line of the CAN bus of the trailer is defective",
      "0372": "The CAN-L line of the CAN bus of the trailer is defective",
      "0400": "The external control unit for the ramp assist has detected a fault. The information is transmitted via the CAN cabin or CAN trailer to the PSM control unit (parameterizable special module).",
      "0460": "Communication failure on the telematics CAN bus",
      "1010": "Internal error in the control unit",
      "1011": "EEPROM malfunction",
      "1012": "Parameterization error in the control unit",
      "1013": "Software not fully loaded.",
      "1014": "Control unit software missing or incorrect.",
      "1015": "Checksum error in the control unit software",
      "1016": "An error has been detected in the control unit software.",
      "1017": "Software: synchronization malfunction",
      "1100": "Increased voltage at terminal 30",
      "1101": "Reduced voltage at terminal 30",
      "1102": "Terminal 30 power supply interruption",
      "1200": "Terminal 15 high voltage",
      "1201": "Terminal 15 low voltage",
      "1210": "Terminal 15 wire break",
      "2020": "The output 'Engine running, alternator OK' (contact X4 18/9) has a short circuit to ground.",
      "2021": "The output 'Engine running, alternator OK' (contact X4 18/9) has a short circuit to positive or an open circuit.",
      "2120": "The output 'Retarder cut-off' (contact X4 18/10) has a short circuit to ground.",
      "2121": "The output 'Retarder cut-off' (contact X4 18/10) has a short circuit to positive or an open circuit.",
      "2220": "The output 'Clutch lock cylinder activation' (contact X4 18/11) has a short circuit to ground.",
      "2221": "The output 'Clutch lock cylinder activation' (contact X4 18/11) has a short circuit to positive or an open circuit.",
      "2320": "The output ‘Clutch activation valve’ (contact X4 18/12) has a short circuit to ground.",
      "2321": "The output ‘Clutch activation valve’ (contact X4 18/12) has a short circuit to positive or an open circuit.",
      "2420": "Activation ‘Output’ (contact X4 18/13) has a short circuit to ground.",
      "2421": "Activation ‘Output’ (contact X4 18/13) has a short circuit to positive or an open circuit.",
      "2520": "Output ‘Power take-off response message’ (contact X4 18/14) has a short circuit to ground.",
      "2521": "Output ‘Power take-off response message’ (contact X4 18/14) has a short circuit to positive or an open circuit.",
      "2620": "The output 'Neutral position' (contact X4 18/15) has a short circuit to ground.",
      "2621": "The output 'Neutral position' (contact X4 18/15) has a short circuit to positive or an open circuit.",
      "2720": "The output 'Power take-off 1 activation' (contact X4 18/16) has a short circuit to ground.",
      "2721": "The output 'Power take-off 1 activation' (contact X4 18/16) has a short circuit to positive or an open circuit.",
      "2722": "Missing response message from power take-off 1 (contact X3 15/7) despite activation of power take-off 1 (contact X4 18/16)",
      "2723": "Missing PTO 1 activation (contact X4 18/16) despite PTO 1 response message (contact X3 15/7)",
      "2820": "Output ‘PTO 2 activation’ (contact X4 18/17) has a short circuit to ground.",
      "2821": "Output ‘PTO 2 activation’ (contact X4 18/17) has a short circuit to positive or an open circuit.",
      "2822": "Missing PTO 2 response message (contact X3 15/8) despite PTO 2 activation (contact X4 18/17)",
      "2823": "Missing PTO 2 activation (contact X4 18/17) despite PTO 2 response message (contact X3 15/8)",
      "2920": "Output ‘Power take-off 3 activation’ (contact X4 18/18,) has a short circuit to ground.",
      "2921": "Output ‘Power take-off 3 activation’ (contact X4 18/18) has a short circuit to positive or an open circuit.",
      "2922": "Missing response message from power take-off 3 (contact X3 15/9) despite activation of power take-off 2 (contact X4 18/18)",
      "2923": "Missing activation of power take-off 3 (contact X4 18/18) despite response message from power take-off (contact X3 15/9)",
      "3020": "Output ‘Reverse gear engaged’ (contact X4 18/9) has a short circuit to ground.",
      "3021": "The output ‘Reverse gear engaged’ (contact X4 18/9) has a short circuit to positive or an open circuit.",
      "3120": "The output ‘Gear G engaged’ (contact X4 18/10) has a short circuit to ground.",
      "3121": "The output ‘Gear 1 engaged’ (contact X4 18/10) has a short circuit to positive or an open circuit.",
      "3220": "The output ‘Kickdown’ (contact X4 18/11) has a short circuit to ground.",
      "3221": "The output ‘Kickdown’ (contact X4 18/11) has a short circuit to positive or an open circuit.",
      "3320": "The output ‘Parking brake’ (contact X4 18/12) has a short circuit to ground.",
      "3321": "The output ‘Parking brake’ (contact X4 18/12) has a short circuit to positive or an open circuit.",
      "3420": "The output ‘ABS malfunction’ (contact X4 18/13) has a short circuit to ground.",
      "3421": "The output ‘ABS malfunction’ (contact X4 18/13) has a short circuit to positive or an open circuit.",
      "3520": "The output ‘Gear 2 engaged’ (contact X4 18/14) has a short circuit to ground.",
      "3521": "The output ‘Gear 2 engaged’ (contact X4 18/14) has a short circuit to positive or an open circuit.",
      "4020": "Output X4 18/9 has a short circuit to ground.",
      "4021": "Output X4 18/9 has a short circuit to positive or an open circuit.",
      "4120": "Output X4 18/10 has a short circuit to ground.",
      "4121": "Output X4 18/10 has a short circuit to positive or an open circuit.",
      "4220": "Output X4 18/11 has a short circuit to ground.",
      "4221": "Output X4 18/11 has a short circuit to positive or an open circuit.",
      "4320": "Output X4 18/12 has a short circuit to ground.",
      "4321": "Output X4 18/12 has a short circuit to positive or an open circuit.",
      "4420": "Output X4 18/13 has a short circuit to ground.",
      "4421": "Output X4 18/13 has a short circuit to positive or an open circuit.",
      "4520": "Output X4 18/14 has a short circuit to ground.",
      "4521": "Output X4 18/14 has a short circuit to positive or an open circuit.",
      "4620": "Output X4 18/15 has a short circuit to ground.",
      "4621": "Output X4 18/15 has a short circuit to positive or an open circuit.",
      "4720": "Output X4 18/16 has a short circuit to ground.",
      "4721": "Output X4 18/16 has a short circuit to positive or an open circuit.",
      "4820": "Output X4 18/17 has short circuit to ground.",
      "4821": "Output X4 18/17 has a short circuit to positive or an open circuit.",
      "4920": "Output X4 18/18 has a short circuit to ground.",
      "4921": "Output X4 18/18 has a short circuit to positive or an open circuit.",
      "5020": "Output ‘Engine speed signal’ (contact X1 18/4) has a short circuit to ground.",
      "5021": "Output ‘Engine speed signal’ (contact X1 18/4) has a short circuit to positive or an open circuit.",
      "5120": "Output ‘Speed signal’ (contact X1 18/5) has a short circuit to ground.",
      "5121": "Output ‘Speed signal contact X1 18/5) has a short circuit to positive or an open circuit electrical circuits.",
      "5220": "Output ‘Nominal torque signal’ (contact X1 18/6) has a short circuit to ground.",
      "5221": "Output ‘Nominal torque signal’ (contact X1 18/6) has a short circuit to positive or an open circuit.",
      "5320": "Output ‘Load limit signal’ (contact X1 18/7) has a short circuit to ground.",
      "5321": "Output ‘Load limit signal’ (contact X1 18/7) has a short circuit to positive or a short circuit.",
      "5420": "Output ‘PWM1 signal (contact XI ? 3/8) has a short circuit to ground.",
      "5421": "Output ‘PWM1 signal -с-_з~Х1 18 8! has a short circuit to positive or an open circuit.",
      "5520": "Output ‘Signal PWM2 conga—X1 ‘3 9 has a short circuit to ground.",
      "5521": "Output’Signal PWM2 conga—X» ‘5 9 has a short circuit to positive or an open circuit.",
      "6040": "Input signal of the sensor p_.chnsgo se — v= • :—act X1 18/11) has a short circuit to ground or an open circuit.",
      "6041": "Input signal of the sensor manual se-imz • X1 18/11) has a short circuit to positive.",
      "6042": "Power supply wire of the sensor s. —ego se — pma contact X1 18/10) has a short circuit to ground.",
      "6043": "The power supply wire of the sensor with .—ого se — •’.?= ko-takgX1 18/10) has a short circuit to positive.",
      "6140": "Input ‘Engine start1’ (contact X2 18/7) has a short circuit to ground.",
      "6141": "Input ‘Engine start’ (contact X2 18/7) has a short circuit to positive.",
      "6240": "Input ‘Engine stop’ (contact X2 18/8) has a short circuit to ground.",
      "6241": "Input ‘Engine stop’ (contact X2 18/8) has a short circuit to positive.",
      "6340": "Input ‘Start interlock’ (contact X2 18/9) has a short circuit to mass.",
      "6341": "The input ‘Start interlock’ (contact X2 18/9) has a short circuit to positive.",
      "6440": "Input 'Blade switch' (contact X2 18/13) has a short circuit to ground.",
      "6441": "Input 'Blade switch' (contact X2 18/13) has a short circuit to positive.",
      "6540": "Input 'Clutch remote control' (contact X4 18/4) has a short circuit to ground.",
      "6541": "Input 'Clutch remote control' (contact X4 18/4) has a short circuit to positive.",
      "6640": "Input 'ABS action' (contact X4 18/4) has a short circuit to ground.",
      "6641": "Input 'ABS action' (contact X4 18/4) has a short circuit to positive.",
      "6740": "Input 'Reverse gear query' (contact X4 18/4) has a short circuit to ground.",
      "6741": "The input ‘Reverse gear query’ (contact X4 18/4) has a short circuit to positive.",
      "6840": "The input ‘Engage gear to neutral’ (contact X4 18/4) has a short circuit to ground.",
      "6841": "The input ‘Engage gear to neutral’ (contact X4 18/4) has a short circuit to positive.",
      "6940": "The input ‘Retarder status’ (contact X4 18/5) has a short circuit to ground.",
      "6941": "The input ‘Retarder status’ (contact X4 18/5) has a short circuit to positive.",
      "7040": "The input ‘Parking brake’ (contact X4 18/5) has a short circuit to ground.",
      "7041": "The ‘Parking brake’ input (contact X4 18/5) has a short circuit to positive.",
      "7440": "Digital input X2 18/7 has a short circuit to ground.",
      "7441": "Digital input X2 18/7 has a short circuit to positive.",
      "7540": "Digital input X2 18/8 has a short circuit to ground.",
      "7541": "Digital input X2 18/8 has a short circuit to positive.",
      "7640": "Digital input X2 18/9 has a short circuit to ground.",
      "7641": "Digital input X2 18/9 has a short circuit to positive.",
      "7740": "Digital input X2 18/13 has a short circuit to ground.",
      "7741": "Digital input X2 18/13 has a short circuit to positive.",
      "7840": "Digital input X4 18/4 has a short circuit to ground.",
      "7841": "Digital input X4 18/4 has a short circuit to positive.",
      "7940": "Digital input X4 18/5 has a short circuit to ground.",
      "7941": "Digital input X4 18/5 has a short circuit to positive.",
      "8080": "The protection function for the power take-off mechanisms was manually overridden."
    },
    "SRS": {
      "0100": "Control unit internal fault",
      "0105": "Control unit internal fault",
      "0201": "Driver side air bag fault has \"Short circuit\" fault",
      "0202": "Driver side air bag fault has \"Open circuit\" fault",
      "0203": "Driver side air bag fault has \"Short circuit\" to ground fault",
      "0204": "Driver side air bag fault has \"Short circuit\" to positive fault",
      "0205": "Driver air bag igniter circuit capacity too high",
      "0206": "Driver air bag igniter circuit capacity too low",
      "0301": "Center seat belt pretensioner in retractor reel has \"Short circuit\" fault short circuit.",
      "0302": "The emergency seat belt tensioner in the center inertia reel has a fault of \"Open circuit\".",
      "0303": "The emergency seat belt tensioner in the center inertia reel has a fault of \"Short circuit\" to ground.",
      "0304": "The emergency seat belt tensioner in the center inertia reel has a fault of \"Short circuit\" to positive.",
      "0305": "The capacity of the ignition circuit of the seat belt tensioner in the center is too large.",
      "0306": "of the ignition circuit of the seat belt tensioner in the center is too small.",
      "0401": "The fault of the driver's side belt tensioner has a fault of \"Short circuit\".",
      "0402": "The driver's side belt tensioner has a fault of \"Open circuit\".",
      "0403": "The tensioner driver side seat belt has a \"Short circuit\" to ground fault.",
      "0404": "Driver side seat belt pretensioner has a \"Short circuit\" to positive fault.",
      "0405": "Driver side seat belt pretensioner ignition circuit capacity is too high.",
      "0406": "Driver side seat belt pretensioner ignition circuit capacity is too low.",
      "0501": "Front passenger side seat belt pretensioner has a \"Short circuit\" fault.",
      "0502": "Front passenger side seat belt pretensioner has an \"Open circuit\" fault.",
      "0503": "Front passenger side seat belt pretensioner has a \"Short circuit\" to ground fault.",
      "0504": "Front passenger side seat belt pretensioner has a \"Short circuit\" to positive fault.",
      "0505": "The capacity of the ignition circuit of the seat belt pretensioner on the front passenger side is too high.",
      "0506": "The capacity of the ignition circuit of the seat belt pretensioner on the front passenger side is too low.",
      "0601": "Indicator lamp 1 has a fault \"Short circuit\" to ground/open circuit.",
      "0602": "Indicator lamp 1 has a fault \"Short circuit\" to positive.",
      "0603": "Indicator lamp 1 has a fault \"Short circuit\" to ground/open circuit.",
      "0604": "Indicator lamp 1 has a fault \"Short circuit\" to positive.",
      "0703": "Indicator lamp 2 has a fault \"Short circuit\" to ground/open circuit.",
      "0704": "Indicator lamp 2 has a fault \"Short circuit\" to positive.",
      "0901": "Low voltage at terminal 15",
      "0902": "High voltage at terminal 15",
      "0903": "The SRS control unit has triggered the airbag(s) deployment.",
      "0904": "The equipment is parameterized incorrectly."
    },
    "TCO": {
      "0004": "Power supply cable break",
      "1000": "CAN error",
      "1100": "CAN error",
      "1200": "Internal error",
      "1400": "Tachograph calibration contains a fault",
      "1500": "Control component fault",
      "1600": "Control component fault",
      "1704": "CAN connection to INS instrument panel faulty",
      "3408": "Speed sensor fault",
      "3504": "Speed sensor fault",
      "4804": "Speed output signal fault",
      "8000": "Driving without tachogram disk",
      "8100": "Tachogram disk of the first driver is missing",
      "8200": "Tachogram disk of the second driver is missing",
      "8300": "Synchronization cannot be started",
      "9000": "Positioning of the tachogram disk is impaired",
      "9600": "Function of the pull-out tray is impaired",
      "9700": "Malfunction in speed recording",
      "9800": "Malfunction in the recorder system",
      "9900": "Malfunction in the recorder system",
      "10000": "Positioning of the tachogram disk is impaired"
    },
    "WS": {
      "0122": "CAN bus overload",
      "0123": "CAN data bus functional failure",
      "0132": "WS control unit lifecycle data incorrect.",
      "0133": "WS control unit parameters incorrect.",
      "0135": "Internal error in control unit",
      "0138": "Internal error in control unit",
      "0139": "Internal error in control unit",
      "0150": "ABS control unit CAN data reception waiting time",
      "0151": "GS control unit CAN data reception waiting time",
      "0152": "FR control unit CAN data reception waiting time",
      "0153": "MR control unit CAN data reception waiting time",
      "0154": "RS control unit CAN data reception waiting time",
      "0155": " CAN data CU FR",
      "0156": "Waiting time for reception of CAN data CU MR",
      "0157": "Waiting time for reception of CAN data CU INS",
      "0158": "Waiting time for reception of CAN data CU BS",
      "0159": "Waiting time for reception of CAN data CU GS",
      "0201": "The transmission oil temperature sensor has a fault \"Short circuit to ground\".",
      "0202": "The measurement range of the transmission oil temperature sensor has been exceeded.",
      "0205": "The measured value of the transmission oil temperature sensor is invalid.",
      "0210": "The maximum permissible temperature of the transmission oil has been exceeded.",
      "0301": "The transfer case temperature sensor has a fault \"Short circuit to ground\".",
      "0302": "The measurement range of the transfer case temperature sensor has been exceeded.",
      "0305": "The measured value of the transfer case temperature sensor is invalid.",
      "0310": "The maximum permissible temperature of the transfer case oil has been exceeded.",
      "0401": "The front axle temperature sensor has a fault \"Short circuit to ground\".",
      "0402": "The measurement range of the front axle temperature sensor has been exceeded.",
      "0405": "The measured value of the front axle temperature sensor is invalid.",
      "0410": "The maximum permissible temperature of the front axle differential oil has been exceeded.",
      "0501": "The rear axle temperature sensor has a fault \"Short circuit to ground\".",
      "0502": "The measurement range of the rear axle temperature sensor has been exceeded.",
      "0505": "The measured value of the rear axle temperature sensor is invalid.",
      "0510": "The maximum permissible temperature of the rear axle differential oil has been exceeded.",
      "0601": "The condensate sensor has a fault \"Short circuit\" to ground.",
      "0604": "The condensate sensor has a fault \"Open circuit\".",
      "0605": "The measured value of the condensate sensor is invalid.",
      "1011": "The difference in brake pad wear between the brakes of the 1st front axle is too great.",
      "1012": "The difference in brake pad wear between the 1st front axle and the other axles is too great.",
      "1111": "The difference in brake pad wear between the brakes of the 2nd front axle is too great.",
      "1112": "The difference in brake pad wear between the brakes of the 2nd front axle and the other axles is too great.",
      "1211": "The difference in brake pad wear between the brakes of the 1st rear axle is too great.",
      "1212": "The difference in brake pad wear between the 1st rear axle and the other axles is too great.",
      "1311": "The difference in brake pad wear between the brakes of the 2nd rear axle is too great.",
      "1312": "Too much difference in brake pad wear between the 2nd rear axle and the other axles.",
      "1401": "Short circuit in the signal wire of the left brake pad wear sensor of the 1st front axle.",
      "1402": "The measured value of brake pad wear of the 1st front axle on the left is above the measurement range.",
      "1403": "The measured value of brake pad wear of the 1st front axle on the left is below the measurement range.",
      "1404": "Break in the signal wire of the left brake pad wear sensor of the 1st front axle.",
      "1405": "Invalid measured value of brake pad wear of the 1st front axle on the left.",
      "1420": "Failure of the CAN signal of brake pad wear of the 1st front axle on the left",
      "1501": "Short circuit in the signal wires of the right brake pad wear sensor of the 1st front axle.",
      "1502": "The measured value of brake pad wear of the 1st front axle on the right is above the measurement range.",
      "1503": "The measured value of brake pad wear of the 1st front axle on the right is below the measurement range.",
      "1504": "Break in the signal wire of the right brake pad wear sensor of the 1st front axle.",
      "1505": "Invalid measured value of brake pad wear of the 1st front axle on the right.",
      "1520": "Failure of the CAN signal of brake pad wear of the 1st front axle on the right",
      "1601": "Short circuit in the signal wire of the left brake pad wear sensor of the 2nd front axle.",
      "1602": "Measured value of brake pad wear 2nd front axle left above the measurement range.",
      "1603": "The measured value of brake pad wear of the 2nd front axle left is below the measurement range.",
      "1604": "Break in the signal wire of the left sensor of brake pads of the 2nd front axle.",
      "1605": "Invalid measured value of brake pad wear of the 2nd front axle left.",
      "1620": "Failure of the CAN signal of brake pad wear of the 2nd front axle left",
      "1701": "Short circuit in the signal wire of the right sensor of brake pads of the 2nd front axle.",
      "1702": "The measured value of brake pad wear of the 2nd front axle right is above the measurement range.",
      "1703": "The measured value of brake pad wear of the 2nd front axle right is below measurement range.",
      "1704": "Break in the signal wire of the right brake pad wear sensor of the 2nd front axle.",
      "1705": "Invalid measured value of brake pad wear of the 2nd front axle on the right.",
      "1720": "Failure of the CAN signal of brake pad wear of the 2nd front axle on the right",
      "1801": "Short circuit in the signal wire of the left brake pad wear sensor of the 1st rear axle.",
      "1802": "The measured value of brake pad wear of the 1st rear axle on the left is above the measurement range.",
      "1803": "The measured value of brake pad wear of the 1st rear axle on the left is below the measurement range.",
      "1804": "Break in the signal wire of the left brake pad wear sensor of the 1st rear axle.",
      "1805": "Invalid measured value of brake pad wear of the 1st rear axle on the left.",
      "1820": "Failure of the CAN signal for brake pad wear of the 1st rear axle on the left",
      "1901": "Short circuit in signal wire of right brake pad wear sensor of 1st rear axle.",
      "1902": "Measured value of brake pad wear of 1st rear axle on the right is above the measurement range.",
      "1903": "Measured value of brake pad wear of 1st rear axle on the right is below the measurement range.",
      "1904": "Break in signal wire of right brake pad wear sensor of 1st rear axle.",
      "1905": "Invalid measured value of brake pad wear of 1st rear axle on the right.",
      "1920": "Failure of CAN signal of brake pad wear of 1st rear axle on the right",
      "2001": "Short circuit in signal wire of left brake pad wear sensor of 2nd rear axle.",
      "2002": "Measured value brake pad wear sensor for the 2nd rear axle on the left is above the measurement range.",
      "2003": "The measured value of brake pad wear for the 2nd rear axle on the left is below the measurement range.",
      "2004": "Break in the signal wire of the left sensor of brake pad wear for the 2nd rear axle.",
      "2005": "Invalid measured value of brake pad wear for the 2nd rear axle on the left.",
      "2020": "Failure of the CAN signal of brake pad wear for the 2nd rear axle on the left",
      "2101": "Short circuit in the signal wire of the right sensor of brake pad wear for the 2nd rear axle.",
      "2102": "The measured value of brake pad wear for the 2nd rear axle on the right is above the measurement range.",
      "2103": "The measured value of brake pad wear for the 2nd rear axle on the right is below the measurement range measurements.",
      "2104": "Break in the signal wire of the right brake pad wear sensor of the 2nd rear axle.",
      "2105": "Invalid measured value of brake pad wear of the 2nd rear axle on the right.",
      "2120": "Failure of the CAN signal for brake pad wear of the 2nd rear axle on the right",
      "2205": "Invalid measured value (trip signal) of the tachograph.",
      "2320": "Failure of the CAN signal ‘Residual pressure of circuit 1 or 2’ (INS)",
      "3105": "Invalid signal of the speed of the SZ.",
      "3120": "Failure of the speed signal of the SZ via CAN",
      "3220": "Failure of the speed signal via CAN",
      "3320": "Failure of the signal of the set value of the engine torque via CAN",
      "3420": "CAN signal for measured value of outside air temperature failed",
      "3520": "CAN signal for measured value of air filter contamination failed",
      "4105": "Invalid measured value of oil temperature in the retarder",
      "4110": "Maximum permissible oil temperature in the retarder has been exceeded",
      "4120": "CAN signal for measured value of oil temperature in the retarder (retarder) failed",
      "5105": "Invalid measured value of engine oil temperature.",
      "5110": "Maximum permissible engine oil temperature has been exceeded.",
      "5113": "Incorrect engine oil viscosity.",
      "5120": "CAN signal for measured value of engine oil temperature failed",
      "5205": "Invalid measured value of coolant temperature.",
      "5210": "Maximum permissible coolant temperature exceeded.",
      "5220": "CAN signal for measured value of coolant temperature failed",
      "5320": "CAN signal for measured value of fuel consumption failed",
      "7120": "CAN signal for actual value of clutch failed"
    },
    "ZHE": {
      "0000": "Control unit fault",
      "0001": "Control unit fault, internal temperature sensor",
      "0100": "Autonomous heater does not start",
      "0104": "Operation blocking after unsuccessful start",
      "0200": "Flame failure occurs repeatedly",
      "0301": "Overvoltage",
      "0302": "Undervoltage",
      "0400": "Premature flame recognition",
      "0501": "Flame sensor short circuit",
      "0502": "Flame sensor open circuit",
      "0601": "Temperature sensor short circuit",
      "0602": "Temperature sensor open circuit",
      "0701": "Dosing pump short circuit",
      "0702": "Dosing pump open circuit",
      "0801": "Short circuit fan motor short circuit",
      "0802": "Fan motor open circuit",
      "0803": "Fan motor speed incorrect",
      "0901": "Glow plug short circuit",
      "0902": "Glow plug open circuit",
      "1000": "Auxiliary heater overheating",
      "1004": "Overheating or overcontrol has occurred too many times (operation lockout)",
      "1101": "Water pump short circuit",
      "1102": "Water pump open circuit",
      "1201": "Setpoint sensor short circuit",
      "1202": "Setpoint sensor open circuit",
      "1301": "Overheat sensor has a short circuit",
      "1302": "Overheat sensor has an open circuit",
      "1303": "Overheat sensor out of tolerance/operation range (Over-control detection)",
      "1401": "The relay connection to the water pump has a short circuit",
      "1501": "Short circuit at the external component connection",
      "1601": "The relay connection for the external fan has a short circuit",
      "1620": "The relay connection for the external fan has an open circuit",
      "1701": "The fan excitation for switching the water circuits has a short circuit",
      "1702": "The fan excitation for switching the water circuits has an open circuit"
    }
  }
}